[
  {
    "timeline": "2879 TCN–258 TCN",
    "name": "Hồng Bàng",
    "source": "https://vi.wikipedia.org//wiki/H%E1%BB%93ng_B%C3%A0ng_th%E1%BB%8B",
    "detail": "Hồng Bàng thị (chữ Hán: 鴻龐氏) hay Thời đại Hồng Bàng là một giai đoạn lịch sử thuộc thời đại thượng cổ của lịch sử Việt Nam.",
    "relativeKeyWord": "kinh dương vương lạc long quân hùng quốc vương hùng hiền vương hùng lân vương hùng diệp vương hùng hi vương hùng huy vương hùng chiêu vương hùng vĩ vương hùng định vương hùng uy vương hùng trinh vương hùng vũ vương hùng việt vương hùng anh vương hùng triêu vương hùng tạo vương hùng nghị vương hùng duệ vương hùng kính vương hồng bàng2879 tcn258 tcnhồng bàng thị chữ hán  hay thời đại hồng bàng là một giai đoạn lịch sử thuộc thời đại thượng cổ của lịch sử việt nam"
  },
  {
    "timeline": "257 TCN–179 TCN",
    "name": "Âu Lạc",
    "source": "https://vi.wikipedia.org//wiki/%C3%82u_L%E1%BA%A1c",
    "detail": "Âu Lạc (chữ Hán:甌貉/甌駱;) là nhà nước cổ của người Việt cổ được thành lập tại miền Bắc Việt Nam bởi một nhân vật có thật tên là Thục Phán (An Dương Vương) năm 257 TCN. Nhà nước này đã thống nhất 2 bộ tộc Âu Việt - Lạc Việt (Sử gọi là Văn Lang) lại với nhau và đã bảo vệ đất nước thành công trước cuộc xâm lược của nhà Tần, nhưng sau cùng, nhà nước sụp đổ do thất bại trước Nam Việt của Triệu Đà (một quan lại nhà Tần), tạo cơ sở cho nhà Hán xâm lược sau này.",
    "relativeKeyWord": "an dương vương âu lạc257 tcn179 tcnâu lạc chữ hán là nhà nước cổ của người việt cổ được thành lập tại miền bắc việt nam bởi một nhân vật có thật tên là thục phán an dương vương năm 257 tcn nhà nước này đã thống nhất 2 bộ tộc âu việt  lạc việt sử gọi là văn lang lại với nhau và đã bảo vệ đất nước thành công trước cuộc xâm lược của nhà tần nhưng sau cùng nhà nước sụp đổ do thất bại trước nam việt của triệu đà một quan lại nhà tần tạo cơ sở cho nhà hán xâm lược sau này"
  },
  {
    "timeline": "204 TCN–111 TCN",
    "name": "Nhà Triệu",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_Tri%E1%BB%87u",
    "detail": "Nhà Triệu (chữ Hán: 趙朝; bính âm: Zhào cháo; Hán Việt: Triệu triều) là triều đại duy nhất cai trị nước Nam Việt (ngày nay gồm 1 phần của Miền Nam Trung Quốc và Miền Bắc Việt Nam) suốt giai đoạn 204–111 trước Công nguyên.",
    "relativeKeyWord": "triệu vũ vương triệu văn vương triệu minh vương triệu ai vương triệu dương vương nhà triệu204 tcn111 tcnnhà triệu chữ hán  bính âm zhào cháo hán việt triệu triều là triều đại duy nhất cai trị nước nam việt ngày nay gồm 1 phần của miền nam trung quốc và miền bắc việt nam suốt giai đoạn 204111 trước công nguyên"
  },
  {
    "timeline": "40–43",
    "name": "Hai Bà Trưng",
    "source": "https://vi.wikipedia.org//wiki/Hai_B%C3%A0_Tr%C6%B0ng",
    "detail": "Hai Bà Trưng (13 tháng 9 năm 14 – 5 tháng 3 năm 43) là tên chỉ chung hai chị em Trưng Trắc (徵側) và Trưng Nhị (徵貳), hai người phụ nữ được đánh giá là anh hùng dân tộc của người Việt. Trong sử sách, hai bà được biết đến như là những thủ lĩnh khởi binh chống lại chính quyền đô hộ của Đông Hán, lập ra một quốc gia với kinh đô tại Mê Linh và Trưng Trắc tự phong là Nữ vương. Thời kì của hai Bà xen giữa thời kỳ Bắc thuộc lần 1 và Bắc thuộc lần 2 trong lịch sử Việt Nam. Đại Việt sử ký toàn thư coi Trưng Trắc là một vị vua trong lịch sử, với tên gọi Trưng Nữ vương (徵女王).",
    "relativeKeyWord": "trưng nữ vương hai bà trưng4043hai bà trưng 13 tháng 9 năm 14  5 tháng 3 năm 43 là tên chỉ chung hai chị em trưng trắc  và trưng nhị  hai người phụ nữ được đánh giá là anh hùng dân tộc của người việt trong sử sách hai bà được biết đến như là những thủ lĩnh khởi binh chống lại chính quyền đô hộ của đông hán lập ra một quốc gia với kinh đô tại mê linh và trưng trắc tự phong là nữ vương thời kì của hai bà xen giữa thời k bắc thuộc lần 1 và bắc thuộc lần 2 trong lịch sử việt nam đại việt sử k toàn thư coi trưng trắc là một vị vua trong lịch sử với tên gọi trưng nữ vương "
  },
  {
    "timeline": "544–602",
    "name": "Nhà Tiền Lý",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_Ti%E1%BB%81n_L%C3%BD",
    "detail": "Nhà Tiền Lý (chữ Nôm: 茹前李, chữ Hán: 前李朝, Hán Việt: Tiền Lý triều, 544 – 602) là một triều đại trong lịch sử Việt Nam, gắn liền với quốc hiệu Vạn Xuân. Nhà Tiền Lý kéo dài 61 năm và nước Vạn Xuân kéo dài 58 năm, tổng cộng ba đời vua, trong đó có hai vua họ Lý và một vua họ Triệu cũng được tính gộp vào nhà Tiền Lý, tương tự như Dương Tam Kha trong nhà Ngô sau đó.",
    "relativeKeyWord": "l nam đế triệu việt vương hậu l nam đế l sư lợi nhà tiền l544602nhà tiền l chữ nôm  chữ hán  hán việt tiền l triều 544  602 là một triều đại trong lịch sử việt nam gắn liền với quốc hiệu vạn xuân nhà tiền l kéo dài 61 năm và nước vạn xuân kéo dài 58 năm tổng cộng ba đời vua trong đó có hai vua họ l và một vua họ triệu cũng được tính gộp vào nhà tiền l tương tự như dương tam kha trong nhà ngô sau đó"
  },
  {
    "timeline": "603–905 hoặc 939",
    "name": "Thời kỳ Bắc thuộc lần thứ ba",
    "source": "https://vi.wikipedia.org//wiki/Th%E1%BB%9Di_k%E1%BB%B3_B%E1%BA%AFc_thu%E1%BB%99c_l%E1%BA%A7n_th%E1%BB%A9_ba",
    "detail": "Bắc thuộc lần thứ ba (chữ Nôm: 北屬吝次三, ngắn gọn: Bắc thuộc lần 3) trong lịch sử Việt Nam kéo dài từ năm 602 đến năm 905 hoặc năm 939. Thời kỳ này bắt đầu khi Tùy Văn Đế sai Lưu Phương đánh chiếm nước Vạn Xuân, bức hàng Hậu Lý Nam Đế, kéo dài cho đến khi Khúc Thừa Dụ tiến vào Đại La, giành quyền cai quản toàn bộ Tĩnh Hải quân năm 905 - thời Đường Ai Đế, ông vua bù nhìn trong tay quyền thần Chu Ôn.",
    "relativeKeyWord": "mai hắc đế mai thiếu đế bạch đầu đế bố cái đại vương phùng an thời k bắc thuộc lần thứ ba603905 hoặc 939bắc thuộc lần thứ ba chữ nôm  ngắn gọn bắc thuộc lần 3 trong lịch sử việt nam kéo dài từ năm 602 đến năm 905 hoặc năm 939 thời k này bắt đầu khi tùy văn đế sai lưu phương đánh chiếm nước vạn xuân bức hàng hậu l nam đế kéo dài cho đến khi khúc thừa dụ tiến vào đại la giành quyền cai quản toàn bộ tĩnh hải quân năm 905  thời đường ai đế ông vua bù nhìn trong tay quyền thần chu ôn"
  },
  {
    "timeline": "905–930; 931–938",
    "name": "Thời kỳ tự chủ Việt Nam",
    "source": "https://vi.wikipedia.org//wiki/Th%E1%BB%9Di_k%E1%BB%B3_t%E1%BB%B1_ch%E1%BB%A7_Vi%E1%BB%87t_Nam",
    "detail": "Tự chủ là thời kỳ đầu khôi phục lại nền độc lập của Việt Nam đầu thế kỷ 10 sau hơn 1000 năm Bắc thuộc. Thời kỳ này, người Việt đã tự cai trị lãnh thổ nhưng chưa xưng làm vua, và chưa đặt quốc hiệu. Bề ngoài, Việt Nam vẫn là một phần lãnh thổ của \"thiên triều\" phương Bắc ở Trung nguyên với tên gọi \"Tĩnh Hải quân\" và người đứng đầu chỉ nối tiếp nhau làm chức Tiết độ sứ như một quan cai trị của Trung Quốc trước đây.",
    "relativeKeyWord": "khúc tiên chủ khúc trung chủ khúc hậu chủ dương đình nghệ kiều công tiễn thời k tự chủ việt nam905930 931938tự chủ là thời k đầu khôi phục lại nền độc lập của việt nam đầu thế k 10 sau hơn 1000 năm bắc thuộc thời k này người việt đã tự cai trị lãnh thổ nhưng chưa xưng làm vua và chưa đặt quốc hiệu bề ngoài việt nam vẫn là một phần lãnh thổ của thiên triều phương bắc ở trung nguyên với tên gọi tĩnh hải quân và người đứng đầu chỉ nối tiếp nhau làm chức tiết độ sứ như một quan cai trị của trung quốc trước đây"
  },
  {
    "timeline": "939–965",
    "name": "Nhà Ngô",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_Ng%C3%B4",
    "detail": "Nhà Ngô (chữ Nôm: 茹吳, chữ Hán: 吳朝, Hán Việt: Ngô triều) là một triều đại quân chủ trong lịch sử Việt Nam, truyền được hai đời nhưng có tới ba vị vua, kéo dài từ năm 939 đến năm 965. Khoảng thời gian xen giữa từ 944 đến 950 còn có Dương Bình Vương tức Dương Tam Kha. Khác với các triều đại quân chủ Việt Nam sau này, các vua nhà Ngô vẫn xưng tước vương mà chưa xưng đế hiệu trên phạm vi toàn lãnh thổ do họ cai trị.",
    "relativeKeyWord": "tiền ngô vương dương bình vương thiên sách vương nam tấn vương ngô sứ quân nhà ngô939965nhà ngô chữ nôm  chữ hán  hán việt ngô triều là một triều đại quân chủ trong lịch sử việt nam truyền được hai đời nhưng có tới ba vị vua kéo dài từ năm 939 đến năm 965 khoảng thời gian xen giữa từ 944 đến 950 còn có dương bình vương tức dương tam kha khác với các triều đại quân chủ việt nam sau này các vua nhà ngô vẫn xưng tước vương mà chưa xưng đế hiệu trên phạm vi toàn lãnh thổ do họ cai trị"
  },
  {
    "timeline": "968–980",
    "name": "Nhà Đinh",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_%C4%90inh",
    "detail": "Nhà Đinh (chữ Nôm: 茹丁, chữ Hán: 丁朝, Hán Việt: Đinh triều) là triều đại quân chủ phong kiến trong lịch sử Việt Nam bắt đầu năm 968, sau khi Đinh Tiên Hoàng dẹp xong loạn 12 sứ quân thống nhất đất nước và kết thúc năm 980 khi con của Đinh Tiên Hoàng là Đinh Phế Đế nhường ngôi cho Lê Hoàn.",
    "relativeKeyWord": "đinh tiên hoàng đinh phế đế nhà đinh968980nhà đinh chữ nôm  chữ hán  hán việt đinh triều là triều đại quân chủ phong kiến trong lịch sử việt nam bắt đầu năm 968 sau khi đinh tiên hoàng dẹp xong loạn 12 sứ quân thống nhất đất nước và kết thúc năm 980 khi con của đinh tiên hoàng là đinh phế đế nhường ngôi cho lê hoàn"
  },
  {
    "timeline": "980–1009",
    "name": "Nhà Tiền Lê",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_Ti%E1%BB%81n_L%C3%AA",
    "detail": "Nhà Lê (chữ Nôm: 茹黎, chữ Hán: 黎朝, Hán Việt: Lê triều), hay còn được gọi là nhà Tiền Lê (chữ Nôm: 家前黎, Chữ Hán: 前黎朝, Hán Việt: Tiền Lê triều) là một triều đại quân chủ trong lịch sử Việt Nam, bắt đầu khi Đinh Phế Đế nhường ngôi cho Lê Hoàn vào năm 980, trải qua ba đời quân chủ và chấm dứt khi Lê Long Đĩnh qua đời. Quốc hiệu vẫn là Đại Cồ Việt.",
    "relativeKeyWord": "lê đại hành lê trung tông lê ngoạ triều nhà tiền lê9801009nhà lê chữ nôm  chữ hán  hán việt lê triều hay còn được gọi là nhà tiền lê chữ nôm  chữ hán  hán việt tiền lê triều là một triều đại quân chủ trong lịch sử việt nam bắt đầu khi đinh phế đế nhường ngôi cho lê hoàn vào năm 980 trải qua ba đời quân chủ và chấm dứt khi lê long đĩnh qua đời quốc hiệu vẫn là đại cồ việt"
  },
  {
    "timeline": "1009–1225",
    "name": "Nhà Lý",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_L%C3%BD",
    "detail": "Nhà Lý (chữ Nôm: 茹李, chữ Hán: 李朝, Hán Việt: Lý triều), đôi khi gọi là nhà Hậu Lý (để phân biệt với triều đại Tiền Lý do Lý Bí thành lập) là một triều đại trong nền quân chủ Việt Nam. Triều đại này bắt đầu khi Lý Công Uẩn lên ngôi vào tháng 10 âm lịch năm 1009 sau khi giành được quyền lực từ tay nhà Tiền Lê. Triều đại này trải qua 9 vị hoàng đế và chấm dứt khi Lý Chiêu Hoàng, lúc đó mới có 7 tuổi, bị ép thoái vị để nhường ngôi cho chồng là Trần Cảnh vào năm 1225 – tổng cộng là 216 năm.",
    "relativeKeyWord": "l thái tổ l thái tông l thánh tông l nhân tông l thần tông l anh tông l cao tông l huệ tông l chiêu hoàng nhà l10091225nhà l chữ nôm  chữ hán  hán việt l triều đôi khi gọi là nhà hậu l để phân biệt với triều đại tiền l do l bí thành lập là một triều đại trong nền quân chủ việt nam triều đại này bắt đầu khi l công uẩn lên ngôi vào tháng 10 âm lịch năm 1009 sau khi giành được quyền lực từ tay nhà tiền lê triều đại này trải qua 9 vị hoàng đế và chấm dứt khi l chiêu hoàng lúc đó mới có 7 tuổi bị ép thoái vị để nhường ngôi cho chồng là trần cảnh vào năm 1225  tổng cộng là 216 năm"
  },
  {
    "timeline": "1225–1400",
    "name": "Nhà Trần",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_Tr%E1%BA%A7n",
    "detail": "Nhà Trần (chữ Nôm: 茹陳, chữ Hán: 陳朝, Hán Việt: Trần triều) là một triều đại quân chủ cai trị nước Đại Việt từ năm 1226 đến năm 1400. Đây là triều đại được lưu danh với những chiến công hiển hách trong lịch sử Việt Nam. Triều đại này khởi đầu khi Trần Cảnh lên ngôi vào năm 1226 sau khi được vợ là Lý Chiêu Hoàng truyền ngôi. Những năm đầu tiên, Trần Cảnh còn nhỏ tuổi, toàn bộ quyền hành của nhà Trần đều do một tông thất vai chú của Trần Cảnh là Trần Thủ Độ nắm quyền, chính Trần Thủ Độ đã âm thầm ép Lý Chiêu Hoàng nhường ngôi cho cháu mình.",
    "relativeKeyWord": "trần thái tông trần thánh tông trần nhân tông trần anh tông trần minh tông trần hiến tông trần dụ tông dương nhật lễ trần nghệ tông trần duệ tông trần phế đế trần thuận tông trần thiếu đế nhà trần12251400nhà trần chữ nôm  chữ hán  hán việt trần triều là một triều đại quân chủ cai trị nước đại việt từ năm 1226 đến năm 1400 đây là triều đại được lưu danh với những chiến công hiển hách trong lịch sử việt nam triều đại này khởi đầu khi trần cảnh lên ngôi vào năm 1226 sau khi được vợ là l chiêu hoàng truyền ngôi những năm đầu tiên trần cảnh còn nhỏ tuổi toàn bộ quyền hành của nhà trần đều do một tông thất vai chú của trần cảnh là trần thủ độ nắm quyền chính trần thủ độ đã âm thầm ép l chiêu hoàng nhường ngôi cho cháu mình"
  },
  {
    "timeline": "1400–1407",
    "name": "Nhà Hồ",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_H%E1%BB%93",
    "detail": "Nhà Hồ (chữ Nôm: 茹胡, chữ Hán: 胡朝, Hán Việt: Hồ triều) là một triều đại quân chủ trong lịch sử Việt Nam, bắt đầu khi Hồ Quý Ly lên ngôi năm 1400 sau khi giành được quyền lực từ tay nhà Trần và chấm dứt khi Hồ Hán Thương bị quân Minh bắt vào năm 1407 – tổng cộng là 7 năm. Quốc hiệu Đại Việt đã đổi thành Đại Ngu năm 1400.",
    "relativeKeyWord": "hồ qu ly hồ hán thương nhà hồ14001407nhà hồ chữ nôm  chữ hán  hán việt hồ triều là một triều đại quân chủ trong lịch sử việt nam bắt đầu khi hồ qu ly lên ngôi năm 1400 sau khi giành được quyền lực từ tay nhà trần và chấm dứt khi hồ hán thương bị quân minh bắt vào năm 1407  tổng cộng là 7 năm quốc hiệu đại việt đã đổi thành đại ngu năm 1400"
  },
  {
    "timeline": "1407–1414",
    "name": "Nhà Hậu Trần",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_H%E1%BA%ADu_Tr%E1%BA%A7n",
    "detail": "Hậu Trần (chữ Nôm: 茹後陳, chữ Hán: 後陳朝, Hán Việt: Hậu Trần triều) là một triều đại trong lịch sử Việt Nam từ 1407 đến 1414 mà các sách sử vẫn chưa thống nhất cách gọi. Sách Đại Việt sử ký toàn thư thì gọi là nhà Hậu Trần, còn Khâm định Việt sử Thông giám cương mục thì hoàn toàn không nhắc đến cụm từ này mà chỉ thuật lại sự việc trong những năm tháng ấy. Ở đây, viết theo sách Đại Việt sử ký toàn thư nên gọi là nhà Hậu Trần.",
    "relativeKeyWord": "giản định đế trùng quang đế nhà hậu trần14071414hậu trần chữ nôm  chữ hán  hán việt hậu trần triều là một triều đại trong lịch sử việt nam từ 1407 đến 1414 mà các sách sử vẫn chưa thống nhất cách gọi sách đại việt sử k toàn thư thì gọi là nhà hậu trần còn khâm định việt sử thông giám cương mục thì hoàn toàn không nhắc đến cụm từ này mà chỉ thuật lại sự việc trong những năm tháng ấy ở đây viết theo sách đại việt sử k toàn thư nên gọi là nhà hậu trần"
  },
  {
    "timeline": "1428–1527",
    "name": "Nhà Hậu Lê",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_H%E1%BA%ADu_L%C3%AA",
    "detail": "Nhà Hậu Lê (chữ Nôm: 茹後黎, chữ Hán: 後黎朝, Hán Việt: Hậu Lê triều; (1428-1789) là một triều đại phong kiến Việt Nam tồn tại sau thời Bắc thuộc lần 4 và đồng thời với nhà Mạc, nhà Tây Sơn trong một thời gian, trước Nhà Nguyễn",
    "relativeKeyWord": "lê thái tổ lê thái tông lê nhân tông lê nghi dân lê thánh tông lê hiến tông lê túc tông lê uy mục lê tương dực lê chiêu tông lê cung hoàng nhà hậu lê14281527nhà hậu lê chữ nôm  chữ hán  hán việt hậu lê triều 14281789 là một triều đại phong kiến việt nam tồn tại sau thời bắc thuộc lần 4 và đồng thời với nhà mạc nhà tây sơn trong một thời gian trước nhà nguyễn"
  },
  {
    "timeline": "1527–1677",
    "name": "Nhà Mạc",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_M%E1%BA%A1c",
    "detail": "Nhà Mạc (chữ Hán: 莫朝 / Mạc triều) là triều đại quân chủ trong lịch sử Việt Nam, bắt đầu khi Mạc Đăng Dung, sau khi dẹp được các bè phái trong cung đình, đã ép vua Lê Cung Hoàng nhà Hậu Lê nhường ngôi tháng 6 năm 1527 và chấm dứt khi vua Mạc Mậu Hợp lập con trai là Mạc Toàn lên ngôi, bị quân đội Lê-Trịnh do Trịnh Tùng chỉ huy đánh bại vào cuối năm 1592 – Sau đó Mạc Toàn lên ngôi nhưng tại vị chỉ được 2 tháng, tổng cộng thời gian tồn tại chính thức của triều đại là gần 66 năm.",
    "relativeKeyWord": "mạc thái tổ mạc thái tông mạc hiến tông mạc tuyên tông mạc mậu hợp mạc toàn nhà mạc15271677nhà mạc chữ hán   mạc triều là triều đại quân chủ trong lịch sử việt nam bắt đầu khi mạc đăng dung sau khi dẹp được các bè phái trong cung đình đã ép vua lê cung hoàng nhà hậu lê nhường ngôi tháng 6 năm 1527 và chấm dứt khi vua mạc mậu hợp lập con trai là mạc toàn lên ngôi bị quân đội lêtrịnh do trịnh tùng chỉ huy đánh bại vào cuối năm 1592  sau đó mạc toàn lên ngôi nhưng tại vị chỉ được 2 tháng tổng cộng thời gian tồn tại chính thức của triều đại là gần 66 năm"
  },
  {
    "timeline": "1533–1789",
    "name": "Nhà Hậu Lê",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_H%E1%BA%ADu_L%C3%AA",
    "detail": "Nhà Hậu Lê (chữ Nôm: 茹後黎, chữ Hán: 後黎朝, Hán Việt: Hậu Lê triều; (1428-1789) là một triều đại phong kiến Việt Nam tồn tại sau thời Bắc thuộc lần 4 và đồng thời với nhà Mạc, nhà Tây Sơn trong một thời gian, trước Nhà Nguyễn",
    "relativeKeyWord": "lê trang tông lê trung tông lê anh tông lê thế tông lê kính tông lê thần tông lê chân tông lê huyền tông lê gia tông lê hy tông lê dụ tông lê duy phường lê thuần tông lê  tông lê hiển tông lê mẫn đế nhà hậu lê15331789nhà hậu lê chữ nôm  chữ hán  hán việt hậu lê triều 14281789 là một triều đại phong kiến việt nam tồn tại sau thời bắc thuộc lần 4 và đồng thời với nhà mạc nhà tây sơn trong một thời gian trước nhà nguyễn"
  },
  {
    "timeline": "1545–1787",
    "name": "Chúa Trịnh",
    "source": "https://vi.wikipedia.org//wiki/Ch%C3%BAa_Tr%E1%BB%8Bnh",
    "detail": "Chúa Trịnh (chữ Nôm: 主鄭, chữ Hán: 鄭王 / Trịnh vương; 1545 – 1787) là một vương tộc phong kiến kiểm soát quyền lực lãnh thổ Đàng Ngoài suốt thời Lê Trung hưng. Về danh nghĩa thì chúa Trịnh là bề tôi của nhà Lê (họ chỉ xưng tước \"vương\", vẫn dùng niên hiệu và nhận sắc phong, chiếu chỉ từ hoàng đế nhà Lê). Tuy nhiên thực tế thì vua Lê không có thực quyền, việc cai trị chủ yếu do chúa Trịnh thực hiện. Bộ máy triều đình lúc này hoạt động theo thể chế lưỡng đầu. Tổng cộng có 11 đời chúa Trịnh chính thức (nếu tính luôn cả Trịnh Kiểm là 12 đời chúa), cai quản xứ Đàng Ngoài trong hơn 2 thế kỷ.",
    "relativeKeyWord": "trịnh tùng trịnh tráng trịnh tạc trịnh căn trịnh cương trịnh giang trịnh doanh trịnh sâm trịnh cán trịnh khải trịnh bồng chúa trịnh15451787chúa trịnh chữ nôm  chữ hán   trịnh vương 1545  1787 là một vương tộc phong kiến kiểm soát quyền lực lãnh thổ đàng ngoài suốt thời lê trung hưng về danh nghĩa thì chúa trịnh là bề tôi của nhà lê họ chỉ xưng tước vương vẫn dùng niên hiệu và nhận sắc phong chiếu chỉ từ hoàng đế nhà lê tuy nhiên thực tế thì vua lê không có thực quyền việc cai trị chủ yếu do chúa trịnh thực hiện bộ máy triều đình lúc này hoạt động theo thể chế lưỡng đầu tổng cộng có 11 đời chúa trịnh chính thức nếu tính luôn cả trịnh kiểm là 12 đời chúa cai quản xứ đàng ngoài trong hơn 2 thế k"
  },
  {
    "timeline": "1558–1777 1780-1802",
    "name": "Chúa Nguyễn",
    "source": "https://vi.wikipedia.org//wiki/Ch%C3%BAa_Nguy%E1%BB%85n",
    "detail": "Chúa Nguyễn (chữ Nôm: 主阮; chữ Hán: 阮王 / Nguyễn vương) (1558-1777, 1780-1802) là tên gọi dùng để chỉ người đứng đầu xứ Đàng Trong tức dải đất từ Thuận Hóa (phía nam đèo Ngang hiện nay) trở vào miền Nam của Việt Nam, đối lập với xứ Đàng Ngoài của các Chúa Trịnh trong thời kỳ Trịnh-Nguyễn phân tranh của lịch sử Việt Nam. Các Chúa Nguyễn bắt đầu từ đầu giai đoạn Lê Trung hưng của Nhà Hậu Lê, hay giữa thế kỷ XVI, cho đến khi bị Nhà Tây Sơn tiêu diệt vào năm 1777, tuy nhiên Nguyễn Phúc Ánh. một hậu duệ của Chúa Nguyễn đã xưng vương và đến năm 1802 thì tiêu diệt Tây Sơn và lập ra triều đại mới thông qua việc xưng đế. Các Chúa Nguyễn chính là tổ tiên của các Hoàng đế Nhà Nguyễn (1802-1945).",
    "relativeKeyWord": "nguyễn hoàng nguyễn phúc nguyên nguyễn phúc lan nguyễn phúc tần nguyễn phúc thái nguyễn phúc chu nguyễn phúc chú nguyễn phúc khoát nguyễn phúc thuần nguyễn phúc dương nguyễn phúc ánh chúa nguyễn15581777 17801802chúa nguyễn chữ nôm  chữ hán   nguyễn vương 15581777 17801802 là tên gọi dùng để chỉ người đứng đầu xứ đàng trong tức dải đất từ thuận hóa phía nam đèo ngang hiện nay trở vào miền nam của việt nam đối lập với xứ đàng ngoài của các chúa trịnh trong thời k trịnhnguyễn phân tranh của lịch sử việt nam các chúa nguyễn bắt đầu từ đầu giai đoạn lê trung hưng của nhà hậu lê hay giữa thế k xvi cho đến khi bị nhà tây sơn tiêu diệt vào năm 1777 tuy nhiên nguyễn phúc ánh một hậu duệ của chúa nguyễn đã xưng vương và đến năm 1802 thì tiêu diệt tây sơn và lập ra triều đại mới thông qua việc xưng đế các chúa nguyễn chính là tổ tiên của các hoàng đế nhà nguyễn 18021945"
  },
  {
    "timeline": "Triều đường chi ấn",
    "name": "Nhà Tây Sơn",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_T%C3%A2y_S%C6%A1n",
    "detail": "Nhà Tây Sơn (chữ Nôm: 家西山, chữ Hán: 西山朝 / Tây Sơn triều) là một triều đại quân chủ trong lịch sử Việt Nam tồn tại từ năm 1778 đến năm 1802, được thành lập trong bối cảnh tranh chấp quyền lực cuối thời Lê Trung hưng (1533–1789). Theo cách gọi của phần lớn sử gia, nhất là các sử gia hiện đại tại Việt Nam thì \"nhà Tây Sơn\" được dùng để gọi triều đại của anh em Nguyễn Nhạc, Nguyễn Lữ và Nguyễn Huệ để phân biệt với nhà Nguyễn của Nguyễn Ánh (vì cùng họ Nguyễn). Ngoài ra, \"Tây Sơn\" cũng chỉ các lãnh tụ và quân đội khởi nghĩa xuất thân từ ấp Tây Sơn; cũng được dùng làm tên cuộc chiến của Tây Sơn.",
    "relativeKeyWord": "thái đức quang trung nguyễn quang toản nhà tây sơntriều đường chi ấnnhà tây sơn chữ nôm  chữ hán   tây sơn triều là một triều đại quân chủ trong lịch sử việt nam tồn tại từ năm 1778 đến năm 1802 được thành lập trong bối cảnh tranh chấp quyền lực cuối thời lê trung hưng 15331789 theo cách gọi của phần lớn sử gia nhất là các sử gia hiện đại tại việt nam thì nhà tây sơn được dùng để gọi triều đại của anh em nguyễn nhạc nguyễn lữ và nguyễn huệ để phân biệt với nhà nguyễn của nguyễn ánh vì cùng họ nguyễn ngoài ra tây sơn cũng chỉ các lãnh tụ và quân đội khởi nghĩa xuất thân từ ấp tây sơn cũng được dùng làm tên cuộc chiến của tây sơn"
  },
  {
    "timeline": "1802–1945",
    "name": "Nhà Nguyễn",
    "source": "https://vi.wikipedia.org//wiki/Nh%C3%A0_Nguy%E1%BB%85n",
    "detail": "Nhà Nguyễn (chữ Nôm: 茹阮, chữ Hán: 阮朝; Hán-Việt: Nguyễn triều) là triều đại quân chủ cuối cùng trong lịch sử Việt Nam. Nhà Nguyễn được thành lập sau khi Nguyễn Ánh (Gia Long) lên ngôi hoàng đế năm 1802 và kết thúc khi Bảo Đại thoái vị vào năm 1945, tổng cộng là 143 năm. Triều Nguyễn là một triều đại đánh dấu nhiều thăng trầm trong lịch sử Việt Nam, đặc biệt là cuộc xâm lược của người Pháp giữa thế kỷ 19.",
    "relativeKeyWord": "gia long minh mạng thiệu trị tự đức dục đức hiệp hoà kiến phúc hàm nghi đồng khánh thành thái duy tân khải định bảo đại nhà nguyễn18021945nhà nguyễn chữ nôm  chữ hán  hánviệt nguyễn triều là triều đại quân chủ cuối cùng trong lịch sử việt nam nhà nguyễn được thành lập sau khi nguyễn ánh gia long lên ngôi hoàng đế năm 1802 và kết thúc khi bảo đại thoái vị vào năm 1945 tổng cộng là 143 năm triều nguyễn là một triều đại đánh dấu nhiều thăng trầm trong lịch sử việt nam đặc biệt là cuộc xâm lược của người pháp giữa thế k 19"
  }
]