[
  {
    "location": "Hà Nội, quận Đống Đa",
    "occurTime": "5/1",
    "name": "Lễ hội Đống Đa",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Nguyễn Huệ",
    "relativeKeyWord": "lễ hội đống đahttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhà nội quận đống đa51lễ hội truyền thống việt nam có liên quan đến nguyễn huệ"
  },
  {
    "location": "Hà Nam, huyện Thanh Liêm",
    "occurTime": "5/1",
    "name": "Hội vật Liễu Đôi",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức tại làng Liễu Đôi. ",
    "relativeKeyWord": "hội vật liễu đôihttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhà nam huyện thanh liêm51lễ hội truyền thống tổ chức tại làng liễu đôi "
  },
  {
    "location": "Hà Nội, Sóc Sơn",
    "occurTime": "6/1",
    "name": "hội Gióng Sóc Sơn",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Thánh Gióng",
    "relativeKeyWord": "hội gióng sóc sơnhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhà nội sóc sơn61lễ hội truyền thống việt nam có liên quan đến thánh gióng"
  },
  {
    "location": "Hà Nội, Đông Anh",
    "occurTime": "6/1",
    "name": "Lễ hội Cổ Loa",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến An Dương Vương",
    "relativeKeyWord": "lễ hội cổ loahttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhà nội đông anh61lễ hội truyền thống việt nam có liên quan đến an dương vương"
  },
  {
    "location": "Ninh Bình, Gia Viễn",
    "occurTime": "6/1",
    "name": "Lễ hội chùa Bái Đính",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. ",
    "relativeKeyWord": "lễ hội chùa bái đínhhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamninh bình gia viễn61lễ hội truyền thống việt nam "
  },
  {
    "location": "Nam Định, Vụ Bản",
    "occurTime": "7/1",
    "name": "Chợ Viềng",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. ",
    "relativeKeyWord": "chợ viềnghttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamnam định vụ bản71lễ hội truyền thống việt nam "
  },
  {
    "location": "Phú Yên, Ô Loan",
    "occurTime": "7/1",
    "name": "Lễ hội đầm Ô Loan",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. ",
    "relativeKeyWord": "lễ hội đầm ô loanhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamphú yên ô loan71lễ hội truyền thống việt nam "
  },
  {
    "location": "Tây Ninh, Đạo Cao Đài",
    "occurTime": "",
    "name": "Đại lễ Đức Chí Tôn",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Đức Chí Tôn",
    "relativeKeyWord": "đại lễ đức chí tônhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamtây ninh đạo cao đàilễ hội truyền thống việt nam có liên quan đến đức chí tôn"
  },
  {
    "location": "Quảng Ninh, núi Yên Tử",
    "occurTime": "10/1",
    "name": "Hội xuân Yên Tử",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức Thiền phái Trúc Lâm, đến hết tháng 3. Có liên quan đến Trần Nhân Tông",
    "relativeKeyWord": "hội xuân yên tửhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamquảng ninh núi yên tử101lễ hội truyền thống tổ chức thiền phái trúc lâm đến hết tháng 3 có liên quan đến trần nhân tông"
  },
  {
    "location": "Phú Thọ, huyện Tam Nông",
    "occurTime": "13/1",
    "name": "Hội phết Hiền Quan",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức Thòi Hùng vương thứ 6 vàtthời Hai Bà Trưng. Có liên quan đến Thiều Hoa công chúa, tứ vị đại tần họ Hà (Hà Hắc Long, Hà Hiên Cương, Hà Thổ Lân và Hà Sơn Thắng), hai tướng công : Bùi Thạch Đa và Bùi Thạch Đê.",
    "relativeKeyWord": "hội phết hiền quanhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamphú thọ huyện tam nông131lễ hội truyền thống tổ chức thòi hùng vương thứ 6 vàtthời hai bà trưng có liên quan đến thiều hoa công chúa tứ vị đại tần họ hà hà hắc long hà hiên cương hà thổ lân và hà sơn thắng hai tướng công  bùi thạch đa và bùi thạch đê"
  },
  {
    "location": "Bắc Ninh, huyện Tiên Du",
    "occurTime": "13/1",
    "name": "Hội Lim",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Nguyễn Đình Diễn",
    "relativeKeyWord": "hội limhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnambắc ninh huyện tiên du131lễ hội truyền thống việt nam có liên quan đến nguyễn đình diễn"
  },
  {
    "location": "Hà Nội, huyện Mỹ Đức",
    "occurTime": "6/1",
    "name": "Lễ hội chùa Hương",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức đến tháng 3 âm lịch. Có liên quan đến Quan Thế Âm Bồ Tát",
    "relativeKeyWord": "lễ hội chùa hươnghttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhà nội huyện m đức61lễ hội truyền thống tổ chức đến tháng 3 âm lịch có liên quan đến quan thế âm bồ tát"
  },
  {
    "location": "Hải Dương, huyện Chí Linh",
    "occurTime": "15/1",
    "name": "Hội chùa Côn Sơn",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Huyền Quang, Nguyễn Trãi",
    "relativeKeyWord": "hội chùa côn sơnhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhải dương huyện chí linh151lễ hội truyền thống việt nam có liên quan đến huyền quang nguyễn trãi"
  },
  {
    "location": "Long An, thị trấn Tầm Vu",
    "occurTime": "14/1",
    "name": "Lễ hội làm chay",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức đến 16/1. Có liên quan đến Đỗ Tường Phong, Đỗ Tường Tự",
    "relativeKeyWord": "lễ hội làm chayhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamlong an thị trấn tầm vu141lễ hội truyền thống tổ chức đến 161 có liên quan đến đỗ tường phong đỗ tường tự"
  },
  {
    "location": "Nhiều quốc gia",
    "occurTime": "15/1",
    "name": "Tết Nguyên tiêu",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức đêm 14 đến nửa đêm 15/1. ",
    "relativeKeyWord": "tết nguyên tiêuhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamnhiều quốc gia151lễ hội truyền thống tổ chức đêm 14 đến nửa đêm 151 "
  },
  {
    "location": "Vĩnh Phúc, huyện Lập Thạch",
    "occurTime": "16/1",
    "name": "Lễ hội chọi trâu",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức không tổ chức từ 1947-2002. ",
    "relativeKeyWord": "lễ hội chọi trâuhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamvĩnh phúc huyện lập thạch161lễ hội truyền thống tổ chức không tổ chức từ 19472002 "
  },
  {
    "location": "Tây Ninh, Núi Bà Đen",
    "occurTime": "4/1",
    "name": "Hội Xuân núi Bà",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức đến 16/1. Có liên quan đến Linh Sơn Thánh Mẫu",
    "relativeKeyWord": "hội xuân núi bàhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamtây ninh núi bà đen41lễ hội truyền thống tổ chức đến 161 có liên quan đến linh sơn thánh mẫu"
  },
  {
    "location": "Hà Nội, Hồ Tây",
    "occurTime": "10/2",
    "name": "Lễ hội đình Yên Phụ",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức khôi phục từ 2003. Có liên quan đến Uy Linh Lang, Vương Duy, Vương Ba",
    "relativeKeyWord": "lễ hội đình yên phụhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhà nội hồ tây102lễ hội truyền thống tổ chức khôi phục từ 2003 có liên quan đến uy linh lang vương duy vương ba"
  },
  {
    "location": "Hà Nội, Đông Anh",
    "occurTime": "10/2",
    "name": "Lễ hội Miếu Mạch Lũng",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Minh Mỗ Đại vương Thượng đẳng thần",
    "relativeKeyWord": "lễ hội miếu mạch lũnghttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhà nội đông anh102lễ hội truyền thống việt nam có liên quan đến minh mỗ đại vương thượng đẳng thần"
  },
  {
    "location": "Đà Nẵng, Ngũ Hành Sơn",
    "occurTime": "19/2",
    "name": "Lễ hội Quán Thế Âm",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức diễn ra trong 3 ngày. Có liên quan đến Quán Thế Âm Bồ Tát",
    "relativeKeyWord": "lễ hội quán thế âmhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamđà nẵng ngũ hành sơn192lễ hội truyền thống tổ chức diễn ra trong 3 ngày có liên quan đến quán thế âm bồ tát"
  },
  {
    "location": "",
    "occurTime": "",
    "name": "Tiết Thanh minh",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức diễn ra sau tiết xuân phân trước tiết cốc vũ. ",
    "relativeKeyWord": "tiết thanh minhhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamlễ hội truyền thống tổ chức diễn ra sau tiết xuân phân trước tiết cốc vũ "
  },
  {
    "location": "Tây Nguyên",
    "occurTime": "",
    "name": "Hội đua voi",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức lớn nhất ở Đắc Lắc, bản Đôn, tổ chức 2 năm 1 lần vào tháng 3 âm lịch. ",
    "relativeKeyWord": "hội đua voihttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamtây nguyênlễ hội truyền thống tổ chức lớn nhất ở đắc lắc bản đôn tổ chức 2 năm 1 lần vào tháng 3 âm lịch "
  },
  {
    "location": "",
    "occurTime": "3/3",
    "name": "Tết Hàn thực",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Giới Tử Thôi, Tấn Văn Công",
    "relativeKeyWord": "tết hàn thựchttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnam33lễ hội truyền thống việt nam có liên quan đến giới tử thôi tấn văn công"
  },
  {
    "location": "Nam Định, Vụ Bản",
    "occurTime": "3/3",
    "name": "Hội Phủ Giầy",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Mẫu Liễu Hạnh",
    "relativeKeyWord": "hội phủ giầyhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamnam định vụ bản33lễ hội truyền thống việt nam có liên quan đến mẫu liễu hạnh"
  },
  {
    "location": "Thừa Thiên Huế, huyện Hương Trà",
    "occurTime": "2/3",
    "name": "Lễ hội Điện Hòn Chén",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Thiên Y A Na",
    "relativeKeyWord": "lễ hội điện hòn chénhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamthừa thiên huế huyện hương trà23lễ hội truyền thống việt nam có liên quan đến thiên y a na"
  },
  {
    "location": "Hà Tây, Quốc Oai",
    "occurTime": "3/3",
    "name": "Lễ hội Chùa Thầy",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức đến 7/3. Có liên quan đến Từ Đạo Hạnh",
    "relativeKeyWord": "lễ hội chùa thầyhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhà tây quốc oai33lễ hội truyền thống tổ chức đến 73 có liên quan đến từ đạo hạnh"
  },
  {
    "location": "Ninh Bình, huyện Hoa Lư",
    "occurTime": "6/3",
    "name": "Lễ hội Hoa Lư",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức tên khác: Lễ hội cố đô Hoa Lư, đến 10/3. Có liên quan đến Đinh Bộ Lĩnh",
    "relativeKeyWord": "lễ hội hoa lưhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamninh bình huyện hoa lư63lễ hội truyền thống tổ chức tên khác lễ hội cố đô hoa lư đến 103 có liên quan đến đinh bộ lĩnh"
  },
  {
    "location": "Ninh Bình, huyện Hoa Lư",
    "occurTime": "14/3",
    "name": "Lễ hội đền Thái Vi",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức đến 16/3. Có liên quan đến Trần Thái Tông, Trần Thánh Tông, Trần Nhân Tông, Trần Anh Tông, Hiển Từ Hoàng Thái Hậu",
    "relativeKeyWord": "lễ hội đền thái vihttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamninh bình huyện hoa lư143lễ hội truyền thống tổ chức đến 163 có liên quan đến trần thái tông trần thánh tông trần nhân tông trần anh tông hiển từ hoàng thái hậu"
  },
  {
    "location": "Hưng Yên, huyện Ân Thi",
    "occurTime": "8/3",
    "name": "Lễ hội Nam Trì",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức kéo dài 5 ngày. Có liên quan đến Lang Công, Bảo Công, Công chúa Hùng vương Lâu nương",
    "relativeKeyWord": "lễ hội nam trìhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhưng yên huyện ân thi83lễ hội truyền thống tổ chức kéo dài 5 ngày có liên quan đến lang công bảo công công chúa hùng vương lâu nương"
  },
  {
    "location": "Nhiều nơi ở Việt Nam",
    "occurTime": "10/3",
    "name": "Giỗ tổ Hùng Vương",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức lớn nhất tại Đền Hùng, Phú Thọ. Có liên quan đến Vua Hùng",
    "relativeKeyWord": "giỗ tổ hùng vươnghttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamnhiều nơi ở việt nam103lễ hội truyền thống tổ chức lớn nhất tại đền hùng phú thọ có liên quan đến vua hùng"
  },
  {
    "location": "Hưng Yên, Phố Hiến",
    "occurTime": "10/3",
    "name": "Lễ hội đền Mẫu",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức đến 15/3. Có liên quan đến Dương Quý Phi",
    "relativeKeyWord": "lễ hội đền mẫuhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhưng yên phố hiến103lễ hội truyền thống tổ chức đến 153 có liên quan đến dương qu phi"
  },
  {
    "location": "Hải Phòng, huyện Cát Hải, Thị trấn Cát Bà",
    "occurTime": "",
    "name": "Lễ hội Làng cá Cát Bà",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức 1/4 dương lịch. Có liên quan đến Hồ Chí Minh",
    "relativeKeyWord": "lễ hội làng cá cát bàhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhải phòng huyện cát hải thị trấn cát bàlễ hội truyền thống tổ chức 14 dương lịch có liên quan đến hồ chí minh"
  },
  {
    "location": "Hà Nội, huyện Gia Lâm",
    "occurTime": "7/4",
    "name": "Hội Gióng Phù Đổng",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Thánh Gióng",
    "relativeKeyWord": "hội gióng phù đổnghttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhà nội huyện gia lâm74lễ hội truyền thống việt nam có liên quan đến thánh gióng"
  },
  {
    "location": "Nhiều quốc gia",
    "occurTime": "8/4",
    "name": "Lễ Phật Đản",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức Phật giáo. Có liên quan đến Phật Tất Đạt Đa",
    "relativeKeyWord": "lễ phật đảnhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamnhiều quốc gia84lễ hội truyền thống tổ chức phật giáo có liên quan đến phật tất đạt đa"
  },
  {
    "location": "Nam Bộ",
    "occurTime": "14/4",
    "name": "Lễ hội Chol Chnam Thmay",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức Tết người Khmer. ",
    "relativeKeyWord": "lễ hội chol chnam thmayhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamnam bộ144lễ hội truyền thống tổ chức tết người khmer "
  },
  {
    "location": "Quảng Ngãi, huyện Lý Sơn",
    "occurTime": "18/3",
    "name": "Lễ khao lề thế lính",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức đến 20/3. ",
    "relativeKeyWord": "lễ khao lề thế línhhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamquảng ngãi huyện l sơn183lễ hội truyền thống tổ chức đến 203 "
  },
  {
    "location": "Miếu Bà Chúa Xứ, Núi Sam, An Giang, Châu Đốc",
    "occurTime": "23/4",
    "name": "Lễ hội miếu Bà Chúa Xứ",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức đến 27/4. Có liên quan đến Bà Chúa Xứ",
    "relativeKeyWord": "lễ hội miếu bà chúa xứhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnammiếu bà chúa xứ núi sam an giang châu đốc234lễ hội truyền thống tổ chức đến 274 có liên quan đến bà chúa xứ"
  },
  {
    "location": "Nhiều quốc gia",
    "occurTime": "5/5",
    "name": "Tết Đoan ngọ",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức Tết giết sâu bọ. ",
    "relativeKeyWord": "tết đoan ngọhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamnhiều quốc gia55lễ hội truyền thống tổ chức tết giết sâu bọ "
  },
  {
    "location": "Nhiều quốc gia",
    "occurTime": "7/7",
    "name": "Thất Tịch",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức Ngày lễ tình nhân Đông phương. Có liên quan đến Ngưu Lang, Chức Nữ",
    "relativeKeyWord": "thất tịchhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamnhiều quốc gia77lễ hội truyền thống tổ chức ngày lễ tình nhân đông phương có liên quan đến ngưu lang chức nữ"
  },
  {
    "location": "Nhiều quốc gia",
    "occurTime": "15/7",
    "name": "Lễ Vu Lan, Tết Trung Nguyên",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức báo hiếu cha mẹ. Có liên quan đến Bồ tát Mục Liên",
    "relativeKeyWord": "lễ vu lan tết trung nguyênhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamnhiều quốc gia157lễ hội truyền thống tổ chức báo hiếu cha mẹ có liên quan đến bồ tát mục liên"
  },
  {
    "location": "Phan Thiết (Bình Thuận)",
    "occurTime": "",
    "name": "Lễ hội Nghinh Ông (Quan Thánh Đế Quân)",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức của Người Hoa, tổ chức vào năm chẵn Tây Lịch. ",
    "relativeKeyWord": "lễ hội nghinh ông quan thánh đế quânhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamphan thiết bình thuậnlễ hội truyền thống tổ chức của người hoa tổ chức vào năm chẵn tây lịch "
  },
  {
    "location": "Bình Thuận",
    "occurTime": "",
    "name": "Lễ hội Katê",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức Lễ hội người Chăm, 1 tháng 7 theo lịch Chăm. ",
    "relativeKeyWord": "lễ hội katêhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnambình thuậnlễ hội truyền thống tổ chức lễ hội người chăm 1 tháng 7 theo lịch chăm "
  },
  {
    "location": "Hải Phòng, Đồ Sơn",
    "occurTime": "9/8",
    "name": "Lễ hội chọi trâu",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. ",
    "relativeKeyWord": "lễ hội chọi trâuhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhải phòng đồ sơn98lễ hội truyền thống việt nam "
  },
  {
    "location": "Nhiều quốc gia",
    "occurTime": "15/8",
    "name": "Tết Trung Thu",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức Tết thiếu nhi. Có liên quan đến Hằng Nga, Hậu Nghệ, Đường Minh Hoàng, Chú Cuội",
    "relativeKeyWord": "tết trung thuhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamnhiều quốc gia158lễ hội truyền thống tổ chức tết thiếu nhi có liên quan đến hằng nga hậu nghệ đường minh hoàng chú cuội"
  },
  {
    "location": "Hải Dương, huyện Chí Linh",
    "occurTime": "15/8",
    "name": "Hội Đền Kiếp Bạc",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức đến 20/8. Có liên quan đến Trần Hưng Đạo",
    "relativeKeyWord": "hội đền kiếp bạchttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamhải dương huyện chí linh158lễ hội truyền thống tổ chức đến 208 có liên quan đến trần hưng đạo"
  },
  {
    "location": "Tây Ninh, Tòa Thánh Tây Ninh",
    "occurTime": "15/8",
    "name": "Hội Yến Diêu Trì",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức Đạo Cao Đài. Có liên quan đến Cao Quỳnh Cư, Phạm Công Tắc, Cao Hoài Sang, Nguyễn Thị Hiếu",
    "relativeKeyWord": "hội yến diêu trìhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamtây ninh tòa thánh tây ninh158lễ hội truyền thống tổ chức đạo cao đài có liên quan đến cao qunh cư phạm công tắc cao hoài sang nguyễn thị hiếu"
  },
  {
    "location": "Bình Thuận, Tiền Giang",
    "occurTime": "",
    "name": "Lễ hội Nghinh Ông (Cá Voi)",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. ",
    "relativeKeyWord": "lễ hội nghinh ông cá voihttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnambình thuận tiền gianglễ hội truyền thống việt nam "
  },
  {
    "location": "Rạch Giá, Kiên Giang",
    "occurTime": "",
    "name": "Lễ hội AHDT Nguyễn Trung Trực",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Nguyễn Trung Trực",
    "relativeKeyWord": "lễ hội ahdt nguyễn trung trựchttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamrạch giá kiên gianglễ hội truyền thống việt nam có liên quan đến nguyễn trung trực"
  },
  {
    "location": "Thái Bình, Vũ Thư",
    "occurTime": "13/9",
    "name": "Lễ hội Chùa Keo",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức đến 15/9. Có liên quan đến Thiền sư Không Lộ",
    "relativeKeyWord": "lễ hội chùa keohttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamthái bình vũ thư139lễ hội truyền thống tổ chức đến 159 có liên quan đến thiền sư không lộ"
  },
  {
    "location": "Nhiều quốc gia",
    "occurTime": "15/10",
    "name": "Tết cơm mới",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống tổ chức Tết song thập. ",
    "relativeKeyWord": "tết cơm mớihttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamnhiều quốc gia1510lễ hội truyền thống tổ chức tết song thập "
  },
  {
    "location": "Ninh Bình, huyện Kim Sơn",
    "occurTime": "13/11",
    "name": "Lễ hội đền Nguyễn Công Trứ",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Nguyễn Công Trứ",
    "relativeKeyWord": "lễ hội đền nguyễn công trứhttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamninh bình huyện kim sơn1311lễ hội truyền thống việt nam có liên quan đến nguyễn công trứ"
  },
  {
    "location": "Nhiều quốc gia",
    "occurTime": "23/12",
    "name": "Tiễn Ông Táo về trời",
    "source": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Vi%E1%BB%87t_Nam",
    "detail": "Lễ hội truyền thống Việt Nam. Có liên quan đến Thổ Công, Thổ địa, Thổ kỳ",
    "relativeKeyWord": "tiễn ông táo về trờihttpsviwikipediaorgwikile1bb85he1bb99ivie1bb87tnamnhiều quốc gia2312lễ hội truyền thống việt nam có liên quan đến thổ công thổ địa thổ k"
  }
]