[
  {
    "occurTime": "Từ 18 tháng 12 đến 30 tháng 12 năm 1972",
    "place": "Miền Bắc Việt Nam: Hà Nội, Hải Phòng, Thái Nguyên, Lạng Sơn, Bắc Giang.",
    "result": "Thắng lợi chiến lược của VNDCCH (Mỹ chấp nhận ký kết Hiệp định Paris với nội dung tương tự với bản dự thảo hiệp định vào tháng 10 năm 1972 - bản mà Hoa Kỳ đã từ chối ký kết).",
    "name": "Trận Điện Biên Phủ trên không năm 1972",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-dien-bien-phu-tren-khong-nam-1972",
    "detail": "12 phi cơ chiến thuật bị bắn rơi 16 B-52 bị bắn rơi 4 B-52 bị hư hại nặng 5 B-52 bị hư hại trung bình 43 tử thương 49 bị bắt làm tù binh3 4",
    "relativeKeyWord": "john dale ryan john w vogt jr văn tiến dũng phùng thế tài lê văn tritrận điện biên phủ trên không năm 1972từ 18 tháng 12 đến 30 tháng 12 năm 1972miền bắc việt nam hà nội hải phòng thái nguyên lạng sơn bắc giangthắng lợi chiến lược của vndcch m chấp nhận k kết hiệp định paris với nội dung tương tự với bản dự thảo hiệp định vào tháng 10 năm 1972  bản mà hoa k đã từ chối k kết"
  },
  {
    "occurTime": "1789",
    "place": "Miền Bắc Đại Việt",
    "result": "Tây Sơn chiến thắng, quân Thanh rút khỏi Đại Việt. Nhà Tây Sơn thay thế nhà Lê. Nhà Tây Sơn chấp nhận triều cống cho nhà Thanh.",
    "name": "Trận Ngọc Hồi - Đống Đa năm 1789",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-ngoc-hoi-dong-da-nam-1789",
    "detail": "Trận Ngọc Hồi - Đống Đa (hay Chiến thắng Kỷ Dậu) là tên gọi do các nhà sử học Việt Nam dành cho loạt trận đánh chống ngoại xâm thắng lợi của nước Đại Việt thời Tây Sơn do vua Quang Trung lãnh đạo vào đầu năm Kỷ Dậu 1789, đánh tan hàng vạn quân Mãn Thanh do Tôn Sĩ Nghị chỉ huy - kéo sang do sự cầu viện của vua Chiêu Thống nhà Lê Trung Hưng.",
    "relativeKeyWord": "nguyễn huệ phan văn lân ngô văn sở nguyễn tăng long đặng xuân bảo nguyễn văn lộc nguyễn văn tuyết đặng tiến đông phan khải đức nguyễn văn diễm nguyễn văn hoà tôn sĩ nghị hứa thế hanh  thượng duy thăng  trương triều long  ô đại kinh sầm nghi đống  thang hùng nghiệp l hóa long  khánh thành hình đôn hành  nhà lêgif srcimageswikitranngochoidongda05869fc73a25b2f4c8999abd4386ab9bgif  hoàng phùng nghĩatrận ngọc hồi  đống đa năm 17891789miền bắc đại việttây sơn chiến thắng quân thanh rút khỏi đại việt nhà tây sơn thay thế nhà lê nhà tây sơn chấp nhận triều cống cho nhà thanh"
  },
  {
    "occurTime": "Tháng 4 năm 1775",
    "place": "Quảng Nam, Việt Nam",
    "result": "Quân Trịnh chiến thắng, Tây Sơn phải quy thuận",
    "name": "Trận Cẩm Sa năm 1775",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-cam-sa-nam-1775",
    "detail": "Trận Cẩm Sa là một phần của cuộc chiến tranh Tây Sơn-Chúa Trịnh vào cuối thế kỷ 18 trong lịch sử Việt Nam giữa chúa Trịnh và chính quyền Tây Sơn của Nguyễn Nhạc.",
    "relativeKeyWord": "trịnh sâm hoàng ngũ phúc nguyễn nghiễm hoàng đình bảo hoàng phùng cơ hoàng đình thể nguyễn đình đống nguyễn nhạc nguyễn lữ l tài tập đìnhtrận cẩm sa năm 1775tháng 4 năm 1775quảng nam việt namquân trịnh chiến thắng tây sơn phải quy thuận"
  },
  {
    "occurTime": "19 tháng 1 năm 1785 - 20 tháng 1 năm 1785",
    "place": "Rạch Gầm - Xoài Mút, tỉnh Mỹ Tho (nay là tỉnh Tiền Giang, Việt Nam)",
    "result": "Quân Tây Sơn đại thắng.",
    "name": "Trận Rạch Gầm – Xoài Mút năm 1785",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-rach-gam-xoai-mut-nam-1785",
    "detail": "Chiêu Tăng Chiêu Sương Lục Côn † Sa Uyển Chiêu Thùy Biện Chúa Nguyễn: Nguyễn Ánh Lê Văn Duyệt Lê Văn Quân Nguyễn Văn Thành Mạc Tử Sanh Nguyễn Văn Oai †…",
    "relativeKeyWord": "nguyễn huệ nguyễn lữ trương văn đa đặng văn chấn chưởng tiền bảo  xiêm la chiêu tăng chiêu sương lục côn  sa uyển chiêu thùy biện chúa nguyễn nguyễn ánh lê văn duyệt lê văn quân nguyễn văn thành mạc tử sanh nguyễn văn oai trận rạch gầm  xoài mút năm 178519 tháng 1 năm 1785  20 tháng 1 năm 1785rạch gầm  xoài mút tỉnh m tho nay là tỉnh tiền giang việt namquân tây sơn đại thắng"
  },
  {
    "occurTime": "Ngày 25 tháng 5 – ngày 22 tháng 6 năm 1786",
    "place": "Quảng Bình, Quảng Trị, Thừa Thiên-Huế, Việt Nam",
    "result": "Quân Trịnh thất bại, mất vùng lãnh thổ từ nam sông Gianh tới Thuận Hóa",
    "name": "Chiến dịch Phú Xuân năm 1786",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-phu-xuan-nam-1786",
    "detail": "Chiến dịch Phú Xuân 1786 là loạt trận đánh giữa quân Tây Sơn và chúa Trịnh trong cuộc nội chiến nước Đại Việt cuối thế kỷ 18. Chiến dịch này là một phần của Chiến tranh Tây Sơn-Chúa Trịnh, mở đầu cho cuộc bắc tiến thắng lợi của quân Tây Sơn trong quá trình tiêu diệt thế lực họ Trịnh tại Bắc Hà.",
    "relativeKeyWord": "nguyễn huệ nguyễn lữ nguyễn hữu chỉnh vũ văn nhậm trịnh khải phạm ngô cầu hoàng đình thể vũ trọng đang hoàng nghĩa hồ vũ tá kiênchiến dịch phú xuân năm 1786ngày 25 tháng 5  ngày 22 tháng 6 năm 1786quảng bình quảng trị thừa thiênhuế việt namquân trịnh thất bại mất vùng lãnh thổ từ nam sông gianh tới thuận hóa"
  },
  {
    "occurTime": "ngày 3 tháng 2 năm 1802 – khoảng tháng 3 cùng năm.",
    "place": "Quảng Bình, Việt Nam",
    "result": "quân chúa Nguyễn toàn thắng",
    "name": "Trận Trấn Ninh năm 1802",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-tran-ninh-nam-1802",
    "detail": "Cảnh Thịnh Nguyễn Quang Thùy Bùi Thị Xuân Nguyễn Văn Kiên Tổng Quân Siêu Tư Lệ Tiết...",
    "relativeKeyWord": "chỉ huy chính cảnh thịnh nguyễn quang thùy bùi thị xuân nguyễn văn kiên tổng quân siêu tư lệ tiết chỉ huy chính nguyễn ánh nguyễn văn trương tống phúc lương đặng trần thường phạm văn nhântrận trấn ninh năm 1802ngày 3 tháng 2 năm 1802  khoảng tháng 3 cùng nămquảng bình việt namquân chúa nguyễn toàn thắng"
  },
  {
    "occurTime": "1 tháng 8 năm 1858 - 5 tháng 6 năm 1862",
    "place": "Nam Kỳ phần phía nam lãnh thổ Đại Nam",
    "result": "Chiến thắng của Pháp giành quyền bảo hộ miền Nam Kỳ, nhà Nguyễn Hòa ước Nhâm Tuất (1862) Là tiền đề đầu tiên trong việc Pháp giành quyền bảo hộ toàn lãnh thổ Đại Nam",
    "name": "Chiến dịch Nam Kỳ năm 1858",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-nam-ky-nam-1858",
    "detail": "Chiến dịch Nam Kỳ là chiến dịch Pháp giành quyền bảo hộ toàn bộ miền Nam Kỳ, nhà Nguyễn bắt đầu từ năm 1858 Pháp phát động cuộc chiến tranh đầu tiên tại bán đảo Sơn Trà, Đà Nẵng đến ngày 5 tháng 6 năm 1862, nhà Nguyễn cắt đất cầu hòa ký hiệp ước với Pháp về việc công nhận nền bảo hộ của Pháp tại Nam Kỳ và không tiếp tục xâm phạm lãnh thổ nhà Nguyễn tại Trung Kỳ và Bắc Kỳ tại Hòa ước Nhâm Tuất (1862). Nhưng không lâu sau đó, Pháp trở mặt, lịch sử chuyển sang giai đoạn mới không còn trong Nam Kỳ.",
    "relativeKeyWord": "tổng thống quân thứ nguyễn tri phương tham tán phạm thế hiển thống chế chu phúc minh đô thống lê đình l tổng đốc trần hoằng chưởng vệ đào trí tham tri phạm khắc thân tham tri nguyễn duy phó đô đốc de genouilly đại tá reynaud đại tá faucon thiếu tá jauréguiberry giám mục pellerin cố vấn chính trị đại tá lanzarotte tây ban nha đại tá oscaritz tây ban nhachiến dịch nam k năm 18581 tháng 8 năm 1858  5 tháng 6 năm 1862nam k phần phía nam lãnh thổ đại namchiến thắng của pháp giành quyền bảo hộ miền nam k nhà nguyễn hòa ước nhâm tuất 1862 là tiền đề đầu tiên trong việc pháp giành quyền bảo hộ toàn lãnh thổ đại nam"
  },
  {
    "occurTime": "31 tháng 8 năm 1858 - 2 tháng 2 năm 1859",
    "place": "Đà Nẵng",
    "result": "Liên quân Pháp - Tây Ban Nha bị cầm chân.",
    "name": "Trận Đà Nẵng năm 1858 - 1859",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-da-nang-nam-1858-1859",
    "detail": "Trận Đà Nẵng (1858-1859) hay Liên quân Pháp – Tây Ban Nha tấn công Đà Nẵng lần thứ nhất là trận đánh mở đầu cho cuộc chiến tranh Pháp-Việt 1858-1884 trong lịch sử Việt Nam. Đây là cuộc chiến kéo dài nhiều ngày, khởi sự từ ngày 31 tháng 8 năm 1858 và kết thúc vào ngày 2 tháng 2 năm 1859, để chuyển sang một giai đoạn khác.",
    "relativeKeyWord": "tổng thống quân thứ nguyễn tri phương tham tán phạm thế hiển thống chế chu phúc minh đô thống lê đình l tổng đốc trần hoằng chưởng vệ đào trí tham tri phạm khắc thân tham tri nguyễn duy phó đô đốc de genouilly đại tá reynaud đại tá faucon thiếu tá jauréguiberry giám mục pellerin cố vấn chính trị đại tá lanzarotte tây ban nha đại tá oscaritz tây ban nhatrận đà nẵng năm 1858  185931 tháng 8 năm 1858  2 tháng 2 năm 1859đà nẵngliên quân pháp  tây ban nha bị cầm chân"
  },
  {
    "occurTime": "17/2/1859",
    "place": "Gia Định, Nam Kỳ",
    "result": "Quân Pháp thắng trận.",
    "name": "Trận thành Gia Định năm 1859",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-thanh-gia-dinh-nam-1859",
    "detail": "Tháng 2 năm 1859, với ý đồ muốn chiếm cứ thành Gia Định (Đại Nam), liên minh Pháp và Tây Ban Nha đã đưa quân vào để đánh chiếm và phá hủy nhiều công trình quân sự của Vương triều nhà Nguyễn, trong đó có thành Gia Định. Trận đánh này được bắt đầu vào rạng sáng ngày 17 tháng 2 năm 1859 và kết thúc khoảng 10 giờ trưa cùng ngày.",
    "relativeKeyWord": "võ duy ninh  vũ thực lê từ  trần trí tôn thất năng charles rigault de genouillytrận thành gia định năm 18591721859gia định nam kquân pháp thắng trận"
  },
  {
    "occurTime": "24-25 tháng 2 năm 1861",
    "place": "Gia Định, Nam Kỳ",
    "result": "Quân Pháp thắng trận",
    "name": "Trận Đại đồn Chí Hòa năm 1861",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-dai-don-chi-hoa-nam-1861",
    "detail": "Trận Đại đồn Chí Hòa hay còn được là Trận Đại đồn Kỳ Hòa, là một trận đánh xảy ra tại Sài Gòn, Nam Kỳ vào 4 giờ sáng ngày 24 tháng 2 năm 1861, và đến khoảng 8 giờ tối ngày hôm sau thì kết thúc. Đại đồn do Tổng thống quân vụ Nguyễn Tri Phương trấn giữ đã bị quân Pháp chiếm mất. Sau lần đại bại này, triều đình nhà Nguyễn, từ chủ trương \"thủ để hòa\" chuyển sang \"chủ hòa\", khiến cho đất đai của Việt Nam cứ mất dần vào tay thực dân Pháp.",
    "relativeKeyWord": "nguyễn tri phương leonard charnertrận đại đồn chí hòa năm 18612425 tháng 2 năm 1861gia định nam kquân pháp thắng trận"
  },
  {
    "occurTime": "26 tháng 3 năm 1861 - 14 tháng 4 năm 1861",
    "place": "Định Tường, Nam Kỳ",
    "result": "Quân Pháp thắng trận",
    "name": "Trận Định Tường năm 1861",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-dinh-tuong-nam-1861",
    "detail": "Tổng đốc Nguyễn Công Nhàn Tuần phủ Nguyễn Hữu Thành Án sát Huỳnh Mẫn Đạt Phó đề đốc Đặng Đức",
    "relativeKeyWord": "chỉ huy chính tổng đốc nguyễn công nhàn tuần phủ nguyễn hữu thành án sát hunh mẫn đạt phó đề đốc đặng đức chỉ huy chính chuẩn đề đốc page trung tá hải quân bourdairs trung tá hải quân desvaux thiếu úy maolini tây ban nhatrận định tường năm 186126 tháng 3 năm 1861  14 tháng 4 năm 1861định tường nam kquân pháp thắng trận"
  },
  {
    "occurTime": "?",
    "place": "?",
    "result": "?",
    "name": "Trận Biên Hòa năm 1861 - 1862",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-bien-hoa-nam-1861-1862",
    "detail": "Trận Biên Hòa hay Pháp đánh chiếm Biên Hòa1 là một phần của cuộc chiến tranh Pháp-Việt 1858-1884 xảy ra từ ngày 14 tháng 12 năm 1861 và kết thúc vào ngày 7 tháng Giêng năm 1862, tức sau khi đánh chiếm được Bà Rịa.",
    "relativeKeyWord": "trận biên hòa năm 1861  1862"
  },
  {
    "occurTime": "?",
    "place": "?",
    "result": "?",
    "name": "Trận Vĩnh Long năm 1862",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-vinh-long-nam-1862",
    "detail": "Trong quá trình xâm lược Việt Nam nửa cuối thế kỷ 19, quân Pháp đánh chiếm thành Vĩnh Long cả thảy hai lần. Trận đầu diễn ra từ ngày 20 cho đến ngày 23 tháng 3 năm 18621 , thì thành thất thủ. Sau khi Hòa ước Nhâm Tuất (1862) được ký kết, ngày 25 tháng 5 năm 1863, tòa thành này lại trở về với nhà Nguyễn. Trận thứ hai diễn ra vào ngày 20 tháng 6 năm 1867, nhưng mãi đến năm 1945, nơi từng có tòa thành này (vì nó đã bị đối phương phá hủy) mới trở về với dân tộc Việt Nam.",
    "relativeKeyWord": "trận vĩnh long năm 1862"
  },
  {
    "occurTime": "20 tháng 4 năm 1859 - 22 tháng 3 năm 1860",
    "place": "Đà Nẵng",
    "result": "Liên quân Pháp - Tây Ban Nha rút khỏi Đà Nẵng.",
    "name": "Trận Đà Nẵng năm 1859-1860",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-da-nang-nam-1859-1860",
    "detail": "Trận Đà Nẵng (1859-1860) hay Liên quân Pháp – Tây Ban Nha tấn công Đà Nẵng lần thứ hai là trận đánh mở đầu cho cuộc chiến tranh Pháp-Việt 1858-1884 trong lịch sử Việt Nam. Đây là cuộc chiến kéo dài nhiều tháng, khởi sự từ 20 tháng 4 năm 1859 và được kết thúc vào 22 tháng 3 năm 1860, là ngày mà tất cả liên quân phải rời khỏi mặt trận Đà Nẵng (Việt Nam), sau 19 tháng chiếm đóng (31 tháng 8 năm 1858 - 22 tháng 3 năm 1860).",
    "relativeKeyWord": "tổng thống quân thứ nguyễn tri phương các cộng sự phạm thế hiển nguyễn hiên nguyễn trọng thao phó đô đốc de genouilly thiếu tướng page các cộng sự faucon lanzarotte reybaud delaveau dupréderoulède breschintrận đà nẵng năm 1859186020 tháng 4 năm 1859  22 tháng 3 năm 1860đà nẵngliên quân pháp  tây ban nha rút khỏi đà nẵng"
  },
  {
    "occurTime": "1873",
    "place": "Bắc Kỳ, Việt Nam",
    "result": "Hòa ước Giáp Tuất với những điều khoản có lợi cho Pháp.",
    "name": "Biến cố Bắc Kỳ năm 1873",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/bien-co-bac-ky-nam-1873",
    "detail": "Sau khi thành Hà Nội thất thủ, triều đình Huế phản kháng mạnh mẽ việc đại úy Garnier bất ngờ đánh thành Hà Nội. Các quan lại và binh lính triều đình cũng nhận được lệnh chuẩn bị đối phó với quân Pháp. Để đáp lại, Garnier cho quân đánh các tỉnh xung quanh Hà Nội để thực hiện việc bình định Bắc Kỳ như một việc đã rồi.",
    "relativeKeyWord": "francis garnier tự đứcbiến cố bắc k năm 18731873bắc k việt namhòa ước giáp tuất với những điều khoản có lợi cho pháp"
  },
  {
    "occurTime": "20 tháng 11 năm 1873",
    "place": "Hà Nội",
    "result": "Pháp chiến thắng",
    "name": "Trận thành Hà Nội năm 1873",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-thanh-ha-noi-nam-1873",
    "detail": "Trận thành Hà Nội 1873 hay còn gọi là trận thành Hà Nội lần thứ nhất là một phần của cuộc chiến tranh Pháp Việt (1858-1884) diễn ra ngày diễn ra ngày 20 tháng 11 năm 1873.",
    "relativeKeyWord": "francis garnier jean dupuis nguyễn tri phươngtrận thành hà nội năm 187320 tháng 11 năm 1873hà nộipháp chiến thắng"
  },
  {
    "occurTime": "21 tháng 12 năm 1873",
    "place": "Cầu Giấy, Hà Nội",
    "result": "Quân Cờ đen chiến thắng",
    "name": "Trận Cầu Giấy năm 1873",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-cau-giay-nam-1873",
    "detail": "Trận Cầu Giấy diễn ra ngày 21 tháng 12 năm 1873 là một trận đánh giữa Quân cờ đen và quân đội viễn chinh Đệ tam Cộng hòa Pháp do Đại úy Francis Garnier chỉ huy. Theo lệnh của Hoàng Tá Viêm, Thống đốc quân thứ Tam Tuyên (Sơn Tây, Hưng Hóa, Tuyên Quang) và của Tôn Thất Thuyết, Tham tán quân thứ Tam Tuyên, Lưu Vĩnh Phúc đem quân đến mai phục ở khu Cầu Giấy cách thành Hà Nội gần 2 dặm về phía nam và cho một nhóm đến sát thành Hà Nội khiêu chiến. Bấy giờ Francis Garnier đang hội đàm buổi thứ hai với phái đoàn của Trần Đình Túc ở trong thành Hà Nội. Thấy ngoài thành có biến, Francis Garnier bỏ họp, đem quân ra ngoài thành nghênh chiến rồi bị phục kích.1 Francis Garnier cùng một số sĩ quan bị giết chết tại trận. Tàn quân của Francis Garnier rút vội vàng rút vào trong thành cố thủ.",
    "relativeKeyWord": "lưu vĩnh phúc francis garnier trận cầu giấy năm 187321 tháng 12 năm 1873cầu giấy hà nộiquân cờ đen chiến thắng"
  },
  {
    "occurTime": "1883–1886",
    "place": "Phía bắc Việt Nam",
    "result": "Pháp chiến thắng",
    "name": "Chiến dịch Bắc Kỳ năm 1883 - 1886",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-bac-ky-nam-1883-1886",
    "detail": "Chiến dịch Bắc Kỳ (tiếng Pháp: Campagne du Tonkin) là một chiến dịch diễn ra từ tháng 6 năm 1883 đến tháng 4 năm 1886 do Pháp tổ chức, nhằm chống lại các đội quân của người Việt, quân cờ đen của Lưu Vĩnh Phúc và đội quân Quảng Tây và Vân Nam của nhà Thanh, với mục tiêu chiếm đóng Bắc Kỳ và giữ vững sự bảo hộ của Pháp tại đó. Với những diễn biến phức tạp của chiến dịch xảy ra vào tháng 8 năm 1884 do bùng phát Chiến tranh Pháp - Thanh và vào tháng 7 năm 1885 do phong trào Cần Vương tại An Nam, chiến dịch cần đến sự tham gia của rất nhiều quân Pháp, dưới cái tên Quân đoàn viễn chinh Bắc Kỳ và sự hỗ trợ từ Đội tàu chiến Bắc Kỳ. Chiến dịch chính thức kết thúc vào tháng 4 năm 1886, khi lực lượng viễn chinh giảm số lượng quân đội chiếm đóng, nhưng tình hình Bắc Kỳ vẫn không ổn định cho đến tận năm 1896.",
    "relativeKeyWord": "chiến dịch bắc k năm 1883  188618831886phía bắc việt nampháp chiến thắng"
  },
  {
    "occurTime": "25 tháng 4 năm 1882",
    "place": "Hà Nội",
    "result": "Pháp chiến thắng",
    "name": "Trận thành Hà Nội năm 1882",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-thanh-ha-noi-nam-1882",
    "detail": "Trận thành Hà Nội 1882 hay còn gọi là trận Hà Nội lần thứ hai là một phần của cuộc chiến tranh Pháp Việt (1858-1884) diễn ra ngày 25 tháng 4 năm 1882. Đây là trận đánh giữa quân Pháp dưới quyền chỉ huy của Henri Rivière đánh thành Hà Nội, với lực lượng quân Nam do Tổng Đốc Hoàng Diệu chỉ huy. Kết quả thành Hà Nội thất thủ nhanh chóng chỉ sau vài giờ nổ súng, Tổng đốc Hoàng Diệu tự vẫn.",
    "relativeKeyWord": "henri rivière hoàng diệutrận thành hà nội năm 188225 tháng 4 năm 1882hà nộipháp chiến thắng"
  },
  {
    "occurTime": "27 tháng 3 năm 1883",
    "place": "Bắc kỳ",
    "result": "Quân Pháp chiến thắng",
    "name": "Trận Nam Định năm 1883",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-nam-dinh-nam-1883",
    "detail": "Trận Nam Định (27 tháng 3 năm 1883), là một cuộc chạm trán giữa quân Pháp và quân Việt Nam, trong giai đoạn đầu của Chiến dịch Bắc Kỳ thuộc chiến tranh Pháp-Việt (1858-1884). Trong một chiến dịch ngắn ngủi vào tuần cuối cùng của tháng 3 năm 1883, Chỉ huy Henri Rivière đánh hạ thành Nam Định, thành phố lớn thứ nhì ở Bắc Kỳ, với một hạm đội pháo thuyền nhỏ và một tiểu đoàn thủy quân đánh bộ.1",
    "relativeKeyWord": "henri rivière vũ trọng bình đề đốc lê văn điếm án sát hồ bá ôn vinh thong chattrận nam định năm 188327 tháng 3 năm 1883bắc kquân pháp chiến thắng"
  },
  {
    "occurTime": "27-28/03/1883",
    "place": "Miền Bắc Việt Nam (Bắc Kỳ)",
    "result": "Pháp chiến thắng",
    "name": "Trận Gia Quất - Gia Lâm năm 1883",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-gia-quat-gia-lam-nam-1883",
    "detail": "Trận Gia Quất-Gia Lâm là một trận đánh trong chiến dịch Bắc Kỳ 1883, giữa quân đội Viễn chinh Pháp và quân đội nhà Nguyễn diễn ra vào các ngày 27-28 tháng 3 năm 1883 tại bờ bắc (tả ngạn) sông Hồng trên các làng Gia Quất, Thượng Cát, thuộc tổng Gia Thụy huyện Gia Lâm tỉnh Bắc Ninh (quân Việt vây đánh quân Pháp phản công phá vây). Các nhà sử học Việt Nam như Trần Văn Giàu, Đinh Xuân Lâm gọi trận này là trận Gia Lâm còn người Pháp thì gọi theo phiên âm là trận Gia Cuc (phiên âm không chính xác từ tên làng Gia Quất). Làng Gia Quất nay thuộc phường Thượng Thanh quận Long Biên Hà Nội.",
    "relativeKeyWord": "berthe de villers phò mã hoàng kế viêm lưu vĩnh phúctrận gia quất  gia lâm năm 18832728031883miền bắc việt nam bắc kpháp chiến thắng"
  },
  {
    "occurTime": "19 tháng 5 năm 1883",
    "place": "Cầu Giấy, ngoại vi Hà Nội",
    "result": "Quân Cờ đen chiến thắng",
    "name": "Trận Cầu Giấy năm 1883",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-cau-giay-nam-1883",
    "detail": "Trận Cầu Giấy diễn ra ngày 19 tháng 5 năm 1883, là một cuộc chạm trán giữa quân Pháp và lực lượng Cờ đen, trong giai đoạn đầu của Chiến dịch Bắc Kỳ tại Cầu Giấy thuộc ngoại vi thành Hà Nội, quân Cờ đen đã phục kích lực lượng Pháp của Rivière trong cuộc chuyển quân từ Hà Nội về Phủ Hoài. Trong trận đánh ngắn kéo dài chưa đầy 3 tiếng này, quân Pháp đã thiệt hại nặng với cái chết của các sĩ quan chỉ huy Henri Rivière, Berthe de Villers và Jacquin. Thất bại của người Pháp đã đánh dấu bước leo thang mới trong cuộc xung đột giữa quân Pháp và lực lượng Đại Nam.",
    "relativeKeyWord": "henri rivière  berthe de villers  lưu vĩnh phúctrận cầu giấy năm 188319 tháng 5 năm 1883cầu giấy ngoại vi hà nộiquân cờ đen chiến thắng"
  },
  {
    "occurTime": "15 tháng 8 1883",
    "place": "Gần Hà Nội, miền bắc Việt Nam",
    "result": "Pháp tuyên bố chiến thắng",
    "name": "Trận Phủ Hoài năm 1883",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-phu-hoai-nam-1883",
    "detail": "Trận Phủ Hoài năm 1883 còn gọi là Trận Vọng hay Trận Dịch Vọng, diễn ra trong các ngày 15-16 tháng 8 năm 1883, là trận tấn công của quân Pháp ở Hà Nội vào phòng tuyến vây quanh Hà Nội về phía Tây Bắc của quân nhà Nguyễn và quân Cờ Đen. Trận này nằm trong kế hoạch của Pháp từ tháng 7 năm đó, tấn công lên Sơn Tây-trung tâm kháng chiến mạnh nhất lúc đó của quân đội nhà Nguyễn, nhằm cùng với việc đánh kinh đô Huế, làm cho nhà Nguyễn phải đầu hàng Pháp.",
    "relativeKeyWord": "alexandreeugène bout lưu vĩnh phúctrận phủ hoài năm 188315 tháng 8 1883gần hà nội miền bắc việt nampháp tuyên bố chiến thắng"
  },
  {
    "occurTime": "Tháng 8 năm 1883",
    "place": "gần Huế, miền trung Việt Nam",
    "result": "Pháp chiến thắng",
    "name": "Trận Cửa Thuận An năm 1883",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-cua-thuan-an-nam-1883",
    "detail": "Trận Cửa Thuận An (20 tháng 8 năm 1883) là trận giao tranh giữa quân Pháp và nước Đại Nam một năm trước khi Chiến tranh Pháp-Thanh (tháng 8 năm 1884 tới tháng 4 năm 1885) bùng nổ. Trong trận này lực lượng thủy quân của Pháp dưới quyền chỉ huy của Đô đốc Amédée Courbet tấn công các pháo đài ven biển ở cửa Thuận An và chiếm đóng cửa ngỏ then chốt lên kinh đô Huế.",
    "relativeKeyWord": "đô đốc amédée courbet không rõtrận cửa thuận an năm 1883tháng 8 năm 1883gần huế miền trung việt nampháp chiến thắng"
  },
  {
    "occurTime": "11 tháng 12 năm 1883 - 16 tháng 12 năm 1883",
    "place": "Sơn Tây",
    "result": "Quân Pháp chiếm được thành Sơn Tây.",
    "name": "Trận Sơn Tây năm 1883",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-son-tay-nam-1883",
    "detail": "Trận Sơn Tây (1883), là trận đánh mà quân đội viễn chinh Pháp tấn công vào thành Sơn Tây, diễn ra từ ngày 13 tháng 12 năm 1883, kết thúc vào tối ngày 16 tháng 12 cùng năm. Đây là một phần của cuộc chiến tranh Pháp-Việt 1858-1884 Đây cũng là trận đánh lớn nhất mà quân Pháp bị thiệt hại nhiều nhất, kể từ năm 1873 (là năm Pháp bắt đầu gây hấn Bắc Kỳ, Việt Nam) cho đến năm 1883.",
    "relativeKeyWord": "đề đốc lưu vĩnh phúc phó đô đốc courbettrận sơn tây năm 188311 tháng 12 năm 1883  16 tháng 12 năm 1883sơn tâyquân pháp chiếm được thành sơn tây"
  },
  {
    "occurTime": "8 tháng 3 năm 1884 - 16 tháng 3 năm 1884",
    "place": "Bắc Ninh, Việt Nam",
    "result": "Quân Pháp chiếm được thành Bắc Ninh.",
    "name": "Trận Bắc Ninh năm 1884",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-bac-ninh-nam-1884",
    "detail": "Trận Bắc Ninh hay Trận Pháp đánh thành Bắc Ninh là một phần của cuộc chiến tranh Pháp-Việt 1858-1884 diễn ra từ ngày 7 tháng 3 năm 1884 và kết thúc vào ngày 12 tháng 3 cùng năm. Đây là trận đánh lớn thứ hai, sau trận thành Sơn Tây, do quân đội Pháp tổ chức tấn công nhằm hoàn thành gấp công cuộc thống trị và bảo hộ Việt Nam của chính phủ Pháp.",
    "relativeKeyWord": "chỉ huy chính hoàng quế lan triệu ốc chỉ huy chính thống tướng charles millot thiếu tướng brière de lisle thiếu tướng franois de négriertrận bắc ninh năm 18848 tháng 3 năm 1884  16 tháng 3 năm 1884bắc ninh việt namquân pháp chiếm được thành bắc ninh"
  },
  {
    "occurTime": "11 tháng 4 năm 1884 - 12 tháng 4 năm 1884",
    "place": "Hưng Hóa, Việt Nam",
    "result": "Quân Pháp chiếm được thành Hưng Hóa.",
    "name": "Trận Hưng Hóa năm 1884",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-hung-hoa-nam-1884",
    "detail": "Trận Hưng Hóa hay Pháp đánh thành Hưng Hóa là một phần của cuộc chiến tranh Pháp-Việt 1858-1884 diễn ra từ ngày 11 tháng 4 năm 1884 và kết thúc vào ngày 12 tháng 4 cùng năm. Đây là một trong số ít trận đánh lớn do quân đội Pháp tổ chức tấn công, để hoàn thành gấp việc đánh chiếm Bắc Kỳ, nhằm thực hiện công cuộc cai trị và bảo hộ Việt Nam của chính phủ Pháp.",
    "relativeKeyWord": "chỉ huy chính sầm dục anh lưu vĩnh phúc hoàng tá viêm nguyễn quang bích chỉ huy chính thống tướng charlesthéodore millot thiếu tướng brière de lisle thiếu tướng franois de négriertrận hưng hóa năm 188411 tháng 4 năm 1884  12 tháng 4 năm 1884hưng hóa việt namquân pháp chiếm được thành hưng hóa"
  },
  {
    "occurTime": "Khoảng cuối tháng 5 năm 1884 – 3 tháng 3 năm 1885",
    "place": "Tuyên Quang, Việt Nam",
    "result": "Quân Pháp chiếm được thành Tuyên Quang.",
    "name": "Trận Tuyên Quang năm 1884",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-tuyen-quang-nam-1884",
    "detail": "Trận Tuyên Quang hay Pháp đánh thành Tuyên Quang là một phần của cuộc chiến tranh Pháp-Việt 1858-1884 diễn ra từ khoảng cuối tháng 5 năm 1884 và kết thúc vào ngày 3 tháng 3 năm 1885. Theo nhận định của Pháp, tính đến thời điểm đó, đây là \"một trận đánh gay go nhất xưa nay ở Bắc Kỳ (Việt Nam)\"; còn theo lời tướng Lưu Vĩnh Phúc, thì \"đã vào trăm trận, chưa có trận nào thắng lớn như trận này.\"1",
    "relativeKeyWord": "chỉ huy chính sầm dục anh lưu vĩnh phúc chỉ huy chính thống tướng charles millot trung tướng brière de lisle trung tá duchesne tướng giovanninelli đại tá dominé đại tá duchesnetrận tuyên quang năm 1884khoảng cuối tháng 5 năm 1884  3 tháng 3 năm 1885tuyên quang việt namquân pháp chiếm được thành tuyên quang"
  },
  {
    "occurTime": "23 tháng 6 năm 1884 – 3 tháng 7 năm 1884",
    "place": "Bắc Lệ, Bắc Giang, Việt Nam",
    "result": "Quân Pháp đại bại",
    "name": "Trận Bắc Lệ năm 1884",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-bac-le-nam-1884",
    "detail": "Trận Bắc Lệ hay còn gọi là Trận cầu Quan Âm, đã diễn ra từ ngày 23 tháng 6 năm 1884 và kết thúc vào ngày 3 tháng 7 cùng năm, là một trận giao tranh lớn giữa quân thực dân Pháp và quân liên minh Việt - Thanh. Kết thúc trận, quân đội Pháp ở Bắc Kỳ (Việt Nam) phải chịu nhiều thiệt hại về người và của, khiến nó trở thành một sự kiện gây hoang mang cho thực dân Pháp và gây nhiều căng thẳng cho mối quan hệ Pháp - Thanh lúc bấy giờ.",
    "relativeKeyWord": "lã xuân oai nguyễn thiện thuật tạ hiện phạm huy quang phan đỉnh tân sầm dục anh vương đức bảng charlesthéodore millot franois oscar de négrier alphonse dugennetrận bắc lệ năm 188423 tháng 6 năm 1884  3 tháng 7 năm 1884bắc lệ bắc giang việt namquân pháp đại bại"
  },
  {
    "occurTime": "Đầu tháng 2 năm 1885 – 1 tháng 4 năm 1885",
    "place": "Lạng Sơn, Bắc Kỳ, Việt Nam",
    "result": "Quân Pháp đại bại",
    "name": "Trận Lạng Sơn năm 1885",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-lang-son-nam-1885",
    "detail": "Trận Lạng Sơn (1885) hay Pháp đánh Lạng Sơn là tên gọi một chiến dịch gồm vài trận giao tranh lớn nhỏ giữa quân Pháp và quân Thanh, đã diễn ra từ đầu tháng 2 năm 1885 và kết thúc vào 1 tháng 4 cùng năm.",
    "relativeKeyWord": "chỉ huy chính phan đỉnh tân  phùng tử tài  vương đức bảng  chỉ huy chính thiếu tướng brière de lisle chuẩn tướng de négrier trung tá herbingertrận lạng sơn năm 1885đầu tháng 2 năm 1885  1 tháng 4 năm 1885lạng sơn bắc k việt namquân pháp đại bại"
  },
  {
    "occurTime": "4 tháng 7 - 5 tháng 7 năm 1885",
    "place": "Huế, Việt Nam",
    "result": "Quân đội Pháp chiến thắng",
    "name": "Trận Kinh thành Huế năm 1885",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-kinh-thanh-hue-nam-1885",
    "detail": "Trận kinh thành Huế năm 1885 là một sự kiện chính trị, một trận tập kích của quân triều đình nhà Nguyễn do Tôn Thất Thuyết chỉ huy đánh vào lực lượng Pháp. Sự kiện xảy ra vào năm Ất Dậu, tức năm 1885 theo dương lịch.",
    "relativeKeyWord": "vua hàm nghi tôn thất thuyết trần xuân soạn tôn thất liệt de courcytrận kinh thành huế năm 18854 tháng 7  5 tháng 7 năm 1885huế việt namquân đội pháp chiến thắng"
  },
  {
    "occurTime": "7 tháng 10 - 22 tháng 12 năm 1947",
    "place": "Bắc Việt Nam",
    "result": "Pháp chiếm giữ một số khu vực biên giới nhưng thất bại về mặt chiến lược Việt Minh giành thắng lợi chiến lược",
    "name": "Chiến dịch Việt Bắc năm 1947",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-viet-bac-nam-1947",
    "detail": "Chiến dịch Việt Bắc Thu - Đông 1947, hay Chiến dịch Léa theo cách gọi của người Pháp, là một chiến dịch quân sự do quân đội Pháp thực hiện tại Việt Nam trong Chiến tranh Đông Dương. Chiến dịch này được xem là chiến thắng lớn đầu tiên của phe Việt Minh trong cuộc chiến, làm thất bại chiến lược \"đánh nhanh thắng nhanh\" của quân Pháp.4",
    "relativeKeyWord": "jeanetienne valluy võ nguyên giáp hoàng văn thái trần tử bình lê thiết hùngchiến dịch việt bắc năm 19477 tháng 10  22 tháng 12 năm 1947bắc việt nampháp chiếm giữ một số khu vực biên giới nhưng thất bại về mặt chiến lược việt minh giành thắng lợi chiến lược"
  },
  {
    "occurTime": "16 tháng 9 - 18 tháng 10 năm 1950",
    "place": "Việt Nam",
    "result": "Thắng lợi chiến lược của Quân đội Nhân dân Việt Nam",
    "name": "Chiến dịch Biên giới năm 1950",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-bien-gioi-nam-1950",
    "detail": "Chiến dịch Biên giới Thu đông 1950 còn gọi là Chiến dịch Lê Hồng Phong 2, là một chiến dịch trong Chiến tranh Đông Dương do quân đội Việt Minh thực hiện từ ngày 16 tháng 9 đến 17 tháng 10 năm 1950, nhằm phá thế bị cô lập của căn cứ địa Việt Bắc, khai thông biên giới Việt - Trung để mở đầu cầu tiếp nhận viện trợ. Một mục tiêu khác nữa là mở rộng căn cứ địa và tiêu diệt một phần sinh lực quân đồn trú của Pháp, thử nghiệm các chiến thuật cho Quân đội Nhân dân Việt Nam khi đó còn thiếu kinh nghiệm đánh lớn.",
    "relativeKeyWord": "marcelmaurice carpentier maurice le page pierre charton pierre jeanpierre võ nguyên giáp chỉ huy trưởng bộ chỉ huy chiến dịch hoàng văn thái tham mưu trưởng chiến dịch trần đăng ninh chủ nhiệm tổng cục cung cấp phụ trách hậu cần chiến dịch vương thừa vũ lê quảng ba đặng văn việtchiến dịch biên giới năm 195016 tháng 9  18 tháng 10 năm 1950việt namthắng lợi chiến lược của quân đội nhân dân việt nam"
  },
  {
    "occurTime": "25 tháng 12 năm 1950 – 17 tháng 1 năm 1951",
    "place": "Tuyến trung du Bắc Bộ từ Việt Trì tới Bắc Giang, Đông Bắc Việt Nam, Liên khu III",
    "result": "Việt Minh phá được vòng vây ở Vĩnh Yên",
    "name": "Chiến dịch Trần Hưng Đạo năm 1950 - 1951",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-tran-hung-dao-nam-1950-1951",
    "detail": "Chiến dịch Trần Hưng Đạo hay Chiến dịch Trung du là một trong những cuộc tiến công lớn của Quân đội nhân dân Việt Nam vào phòng tuyến trung du Bắc Bộ của quân Liên hiệp Pháp. Đây là một trong 3 chiến dịch lớn của Quân đội nhân dân Việt Nam trong đông-xuân 1950-1951.",
    "relativeKeyWord": "de lattre boyer de latour raoul salan maurice redon paul vanuxem alain de maricourt võ nguyên giáp nguyễn chí thanh chu văn tấn trần hữu dực đào văn trường hoàng văn tháichiến dịch trần hưng đạo năm 1950  195125 tháng 12 năm 1950  17 tháng 1 năm 1951tuyến trung du bắc bộ từ việt trì tới bắc giang đông bắc việt nam liên khu iiiviệt minh phá được vòng vây ở vĩnh yên"
  },
  {
    "occurTime": "23 tháng 3 năm 1951 – 5 tháng 4 năm 1952",
    "place": "Đường 18 đoạn từ Phả lại đến Uông Bí, Mạo Khê",
    "result": "Việt Minh giành chiến thắng1",
    "name": "Chiến dịch Hoàng Hoa Thám năm 1950 - 1951",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-hoang-hoa-tham-nam-1950-1951",
    "detail": "Chiến dịch Hoàng Hoa Thám là một trong những cuộc tiến công lớn của Quân đội nhân dân Việt Nam vào khu vực Hải Phòng thuộc đồng bằng Bắc Bộ do quân Liên hiệp Pháp kiểm soát. Đây là một trong 3 chiến dịch lớn trong đông-xuân 1950-1951.",
    "relativeKeyWord": "de lattre de tassigny raoul salan võ nguyên giáp vương thừa vũ lê trọng tấnchiến dịch hoàng hoa thám năm 1950  195123 tháng 3 năm 1951  5 tháng 4 năm 1952đường 18 đoạn từ phả lại đến uông bí mạo khêviệt minh giành chiến thắng1"
  },
  {
    "occurTime": "28 tháng 5 năm 1951 – 20 tháng 6 năm 1951",
    "place": "Hà Nam, Nam Định, Ninh Bình (Việt Nam)",
    "result": "Việt Minh chiến thắng1",
    "name": "Chiến dịch Hà Nam Ninh năm 1951",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-ha-nam-ninh-nam-1951",
    "detail": "Chiến dịch Hà Nam Ninh (còn gọi là chiến dịch Quang Trung) tiến hành từ 28-5 đến 20-6-1951, do Bộ Tổng tư lệnh Quân đội Nhân dân Việt Nam trực tiếp chỉ huy, nhằm phá vỡ phòng tuyến sông Đáy của thực dân Pháp ở mặt trận Hà Nam Ninh thuộc địa bàn 3 tỉnh Hà Nam, Nam Định, Ninh Bình ngày nay. Tham gia chiến dịch này có 3 đại đoàn (308, 304, 320) cùng 5 đại đội sơn pháo, 1 trung đoàn công binh và lực lượng vũ trang địa phương. Kết quả, Quân đội nhân dân Việt Nam đã loại khỏi vòng chiến đấu khoảng 4.000 đối phương, giải phóng và xây dựng một số nơi như Bình Lục, Lý Nhân, Hà Nam, đẩy mạnh chiến tranh du kích ở đồng bằng Bắc Bộ.",
    "relativeKeyWord": "de lattre de linarès hoàng qunh võ nguyên giáp hoàng văn thái lê thanh nghị văn tiến dũng hoàng sâm nguyễn chí thanhchiến dịch hà nam ninh năm 195128 tháng 5 năm 1951  20 tháng 6 năm 1951hà nam nam định ninh bình việt namviệt minh chiến thắng1"
  },
  {
    "occurTime": "10 tháng 11 năm 1951 - 25 tháng 2 năm 1952",
    "place": "Hòa Bình, Việt Nam",
    "result": "Quân đội Nhân dân Việt Nam giành thắng lợi chiến lược",
    "name": "Chiến dịch Hòa Bình năm 1952",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-hoa-binh-nam-1952",
    "detail": "Chiến dịch Hòa Bình (10 tháng 12 năm 1951 - 25 tháng 2 năm 1952) là chiến dịch tiến công của Quân đội Nhân dân Việt Nam (Việt Minh) ở khu vực tại thị xã Hoà Bình-Sông Đà-Đường 6 (cách Hà Nội khoảng 40 – 60 km về phía tây) nhằm diệt sinh lực địch, đánh bại kế hoạch chiếm đóng Hoà Bình của Pháp, phá phòng tuyến Sông Đà (hướng chủ yếu) và tạo điều kiện phát triển chiến tranh du kích ở đồng bằng Bắc Bộ (hướng phối hợp).",
    "relativeKeyWord": "jean de lattre de tassigny raoul salan võ nguyên giáp hoàng văn thái nguyễn chí thanhchiến dịch hòa bình năm 195210 tháng 11 năm 1951  25 tháng 2 năm 1952hòa bình việt namquân đội nhân dân việt nam giành thắng lợi chiến lược"
  },
  {
    "occurTime": "14 tháng 10 - 10 tháng 12 năm 1952.",
    "place": "Đông Dương thuộc Pháp, phần lớn tại Việt Nam",
    "result": "Quân đội Nhân dân Việt Nam chiến thắng, giải phóng một vùng rộng lớn ở địa bàn chiến lược quan trọng",
    "name": "Chiến dịch Tây Bắc năm 1952",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-tay-bac-nam-1952",
    "detail": "Chiến dịch Tây Bắc (từ 14 tháng 10 đến 10 tháng 12 năm 1952) là chiến dịch tiến công của Quân đội Nhân dân Việt Nam (QĐNDVN) trên hướng Tây Bắc Việt Nam nhằm tiêu diệt sinh lực đối phương, giải phóng một bộ phận đất đai, làm thất bại ý đồ của thực dân Pháp lập \"Xứ Thái tự trị\".",
    "relativeKeyWord": "raoul salan võ nguyên giáp hoàng văn tháichiến dịch tây bắc năm 195214 tháng 10  10 tháng 12 năm 1952đông dương thuộc pháp phần lớn tại việt namquân đội nhân dân việt nam chiến thắng giải phóng một vùng rộng lớn ở địa bàn chiến lược quan trọng"
  },
  {
    "occurTime": "13 tháng 4 - 18 tháng 5 năm 1953.",
    "place": "Lào",
    "result": "Quân đội Nhân dân Việt Nam và Quân Giải phóng Nhân dân Lào chiến thắng",
    "name": "Chiến dịch Thượng Lào năm 1953",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-thuong-lao-nam-1953",
    "detail": "Chiến dịch Thượng Lào (13.4-18.5.1953). Chiến dịch tiến công của Quân đội Nhân dân Việt Nam phối hợp với lực lượng Pathét Lào trên địa bàn hai tỉnh Sầm Nưa, Xiêng Khoảng (Thượng Lào) nhằm tiêu diệt một bộ phận sinh lực quân đội Pháp, giải phóng đất đai, mở rộng căn cứ kháng chiến của nhân dân Lào.",
    "relativeKeyWord": "raoul salan võ nguyên giáp hoàng văn thái souphanouvong kaysone phomvihane phoumi vongvichitchiến dịch thượng lào năm 195313 tháng 4  18 tháng 5 năm 1953làoquân đội nhân dân việt nam và quân giải phóng nhân dân lào chiến thắng"
  },
  {
    "occurTime": "13 tháng 3 – 7 tháng 5 năm 1954",
    "place": "Thung lũng Mường Thanh, Điện Biên Phủ",
    "result": "Thắng lợi quyết định của Việt Nam Dân chủ Cộng hòa1 Hiệp định Genève được ký kết, Pháp trao trả độc lập cho 3 nước Đông Dương.",
    "name": "Chiến dịch Điện Biên Phủ năm 1954",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-dien-bien-phu-nam-1954",
    "detail": "Hỗ trợ Quân Vương quốc Lào thuộc Pháp Hoa Kỳ (viện trợ vũ khí và không quân)",
    "relativeKeyWord": "christian de castries andré trancart jules gaucher  pierre langlais andré lalande charles piroth  võ nguyên giáp hoàng văn thái lê liêm đặng kim giang lê trọng tấn chu huy mân vương thừa vũ hoàng minh thảo lê quảng ba song hàochiến dịch điện biên phủ năm 195413 tháng 3  7 tháng 5 năm 1954thung lũng mường thanh điện biên phủthắng lợi quyết định của việt nam dân chủ cộng hòa1 hiệp định genève được k kết pháp trao trả độc lập cho 3 nước đông dương"
  },
  {
    "occurTime": "?",
    "place": "?",
    "result": "?",
    "name": "Chiến dịch Hoàng Diệu năm 1955",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-hoang-dieu-nam-1955",
    "detail": "Chiến dịch Hoàng Diệu (1955) là chiến dịch của Quân đội Quốc gia Việt Nam, theo lệnh của Thủ tướng Ngô Đình Diệm, diễn ra từ ngày 21 tháng 9 năm 1955 và kết thúc ngày 24 tháng 10 năm 1955 nhằm mục đích truy kích và tiêu diệt tàn quân Bình Xuyên.",
    "relativeKeyWord": "chiến dịch hoàng diệu năm 1955"
  },
  {
    "occurTime": "2 tháng 1 năm 1963",
    "place": "10°36′32″B 106°3′1″Đ / 10,60889°B 106,05028°Đ / 10.60889; 106.05028Tọa độ: 10°36′32″B 106°3′1″Đ / 10,60889°B 106,05028°Đ / 10.60889; 106.05028 Ấp Bắc, Việt Nam Cộng hòa UTM Grid XS 29-551",
    "result": "Quân Giải phóng chiến thắng",
    "name": "Trận Ấp Bắc năm 1963",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-ap-bac-nam-1963",
    "detail": "UTM Grid XS 29-551",
    "relativeKeyWord": "hai hoàng bùi đình đàm hunh văn cao john paul vanntrận ấp bắc năm 19632 tháng 1 năm 1963103632b 10631đ  1060889b 10605028đ  1060889 10605028tọa độ 103632b 10631đ  1060889b 10605028đ  1060889 10605028 ấp bắc việt nam cộng hòa utm grid xs 29551quân giải phóng chiến thắng"
  },
  {
    "occurTime": "14 tháng 11-18 tháng 11 năm 1965",
    "place": "13°35′B 107°43′Đ / 13,583°B 107,717°Đ / 13.583; 107.717 (Battle of la Drang)Tọa độ: 13°35′B 107°43′Đ / 13,583°B 107,717°Đ / 13.583; 107.717 (Battle of la Drang) Rặng núi Chu Prông,1 , Việt Nam",
    "result": "Quân Giải phóng miền Nam Việt Nam chiến thắng2 3 4",
    "name": "Trận Ia Đrăng năm 1965",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-ia-drang-nam-1965",
    "detail": "Tại Ia Đrăng: Tiểu đoàn 7 và 9/Trung đoàn 66 và Tiểu đoàn 1/Trung đoàn 33 (khoảng 1.500 bộ binh)",
    "relativeKeyWord": "chu huy mân tư lệnh mặt trận b3 của quân giải phóng nguyễn hữu an b3 tiền phương vũ sắctrung đoàn 336 lê tiến hòa trung đoàn 66 phạm công cửu phó 66  lã ngọc châu chính ủy 66 lê xuân phối866 nguyễn văn định966 không rõ tên h409 stanley larsen iffv hq7 harry kinnard 1acd hq8 richard knowles 1àcd cp 9 thomas w brown8 3rd ac brigade ray lynch 2nd ac brigade10 harold g moore 17 robert mcdade 27 walter b tully 25trận ia đrăng năm 196514 tháng 1118 tháng 11 năm 19651335b 10743đ  13583b 107717đ  13583 107717 battle of la drangtọa độ 1335b 10743đ  13583b 107717đ  13583 107717 battle of la drang rặng núi chu prông1  việt namquân giải phóng miền nam việt nam chiến thắng2 3 4"
  },
  {
    "occurTime": "29 tháng 5 - 31 tháng 5 năm 1965",
    "place": "Ba Gia, Quảng Ngãi, Nam Việt Nam",
    "result": "Quân Giải phóng thắng",
    "name": "Chiến dịch Ba Gia năm 1965",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-ba-gia-nam-1965",
    "detail": "Trận Ba Gia diễn ra từ ngày 29 tháng 5 đến 31 tháng 5 năm 1965 trên địa bàn thị trấn Ba Gia, huyện Sơn Tịnh, tỉnh Quảng Ngãi, là trận đánh góp phần đẩy nhanh sự phá sản của chiến lược Chiến tranh đặc biệt trong Chiến tranh Việt Nam. Trận đánh được tiến hành bởi Trung đoàn 1 bộ binh Quân khu V (Quân Giải phóng miền Nam) nhằm vào một chiến đoàn, 2 tiểu đoàn bộ binh hải quân và 3 tiểu đoàn biệt động quân của Quân lực Việt Nam Cộng hòa. Bằng nhiều phương pháp tác chiến như vây đồn diệt viện, phục kích, tập kích... phối hợp theo một ý định thống nhất, Quân Giải phóng đã chủ động điều động và diệt từng tiểu đoàn quân đối phương trong tiến công vận động. Theo Quân Giải phóng, họ đã diệt gọn bốn tiểu đoàn, đánh thiệt hại nặng hai tiểu đoàn khác. Đây được coi là trận chiến đấu có hiệu suất cao, lần đầu diệt gọn chiến đoàn quân Sài Gòn, đánh dấu sự trưởng thành quan trọng về tổ chức chỉ huy và vận dụng linh hoạt các phương pháp chiến đấu của quân giải phóng Miền Nam Việt Nam, là một trận đánh nổi tiếng trong \"Chiến tranh đặc biệt\".",
    "relativeKeyWord": "nguyễn chánh thi chu huy mânchiến dịch ba gia năm 196529 tháng 5  31 tháng 5 năm 1965ba gia quảng ngãi nam việt namquân giải phóng thắng"
  },
  {
    "occurTime": "28 tháng 12 năm 1964- 1 tháng 1 năm 1965",
    "place": "Bình Giã, miền Nam Việt Nam UTM Grid YS 50-781",
    "result": "Thắng lợi của Quân giải phóng miền Nam",
    "name": "Trận Bình Giã năm 1964",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-binh-gia-nam-1964",
    "detail": "UTM Grid YS 50-781",
    "relativeKeyWord": "lê trọng tấn dương văn nhứt trần đình xu đại úy franklin p eller cố vấn cao cấptrận bình giã năm 196428 tháng 12 năm 1964 1 tháng 1 năm 1965bình giã miền nam việt nam utm grid ys 50781thắng lợi của quân giải phóng miền nam"
  },
  {
    "occurTime": "10 tháng 6-11 tháng 6 năm 1965",
    "place": "Đồng Xoài, Nam Việt Nam UTM Grid YT 0764-75971",
    "result": "Mặt trận Dân tộc Giải phóng miền Nam Việt Nam giành chiến thắng",
    "name": "Trận Đồng Xoài năm 1965",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-dong-xoai-nam-1965",
    "detail": "UTM Grid YT 0764-75971",
    "relativeKeyWord": "lê trọng tấn cao văn viên charles w williamstrận đồng xoài năm 196510 tháng 611 tháng 6 năm 1965đồng xoài nam việt nam utm grid yt 076475971mặt trận dân tộc giải phóng miền nam việt nam giành chiến thắng"
  },
  {
    "occurTime": "18 tháng 8-19, 1966",
    "place": "Long Tân, Phước Tuy Vietnam",
    "result": "Quân đội Úc thắng về chiến thuật, Quân Giải phóng miền Nam Việt Nam bảo vệ được các căn cứ ở Long Tân",
    "name": "Trận Long Tân năm 1966",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-long-tan-nam-1966",
    "detail": "Nguồn Việt Nam:: 3 đại đội, pháo binh từ căn cứ Núi Đất, pháo hạm, trực thăng và xe thiết giáp yểm trợ",
    "relativeKeyWord": "harry smith nguyễn thanh hồng trần minh tâm tỉnh đội bà rịavũng tàu đặng hữu thuấn tỉnh đội bà rịavũng tàutrận long tân năm 196618 tháng 819 1966long tân phước tuy vietnamquân đội úc thắng về chiến thuật quân giải phóng miền nam việt nam bảo vệ được các căn cứ ở long tân"
  },
  {
    "occurTime": "3 – 22 tháng 11 năm 1967",
    "place": "Đắk Tô, tỉnh Kon Tum, Nam Việt Nam",
    "result": "Quân Giải phóng miền Nam Việt Nam giành chiến thắng cả về chiến lược lẫn chiến thuật",
    "name": "Chiến dịch Đắk Tô - Tân Cảnh năm 1967",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-dak-to-tan-canh-nam-1967",
    "detail": "Theo Quân Giải phóng miền Nam Việt Nam: 4.570 chết hoặc bị thương (có 4.030 lính Mỹ), phá hủy 70 máy bay, phá hỏng 3 san bay, 52 xe quân sự (gồm 16 tăng-thiết giáp), 18 pháo và súng cối, 2 kho đạn, 3 kho xăng; thu 104 súng các loại và 17 vô tuyến điện5",
    "relativeKeyWord": "william r peers hoàng minh thảo tư lệnh trần thế môn chính ủy cao văn khánh phó tư lệnh bùi nam hà tham mưu trưởng đặng vũ hiệp chủ nhiệm chính trịchiến dịch đắk tô  tân cảnh năm 19673  22 tháng 11 năm 1967đắk tô tỉnh kon tum nam việt namquân giải phóng miền nam việt nam giành chiến thắng cả về chiến lược lẫn chiến thuật"
  },
  {
    "occurTime": "17 tháng 10 năm 1967",
    "place": "Suối Ông Thành, Chơn Thành, Bình Dương, Nam Việt Nam",
    "result": "Mặt trận Dân tộc Giải phóng miền Nam thắng",
    "name": "Trận Ông Thành năm 1967",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-ong-thanh-nam-1967",
    "detail": "Trận Ông Thành là một trận đánh trong Chiến tranh Việt Nam, diễn ra vào ngày 17 tháng 10 năm 1967 tại khu vực Suối Ông Thành, thuộc huyện Chơn Thành, tỉnh Bình Dương (cách Sài Gòn 60 km về phía tây bắc). Theo các tài liệu tại Mỹ thì đây là cuộc đụng độ giữa Tiểu đoàn 2, Trung đoàn 28 \"Sư tử đen\", Sư đoàn 1 Bộ binh, Quân đội Hoa Kỳ với Trung đoàn 271, Sư đoàn 9 Quân Giải phóng miền Nam. Còn theo Đại tá Võ Minh Triết, chỉ huy Quân Giải phóng trong trận này thì đó là 2 tiểu đoàn thuộc Trung đoàn 1, Sư đoàn 9 Quân Giải phóng. Mặc dù là một chiến thắng lớn của QGP, trận đánh này ít được nhắc đến trong các tài liệu Việt Nam vì nó diễn ra bất ngờ ngoài dự tính (theo Đại tá Triết thì đơn vị của ông bất ngờ chạm địch khi đang hành quân chuẩn bị cho một chiến dịch4 ). Trong thời kì Chiến tranh Việt Nam, phía Mỹ cũng không công bố chi tiết về trận đánh này đến công chúng cho đến năm 1991.",
    "relativeKeyWord": "terry de la mesa allen jr  võ minh triếttrận ông thành năm 196717 tháng 10 năm 1967suối ông thành chơn thành bình dương nam việt nammặt trận dân tộc giải phóng miền nam thắng"
  },
  {
    "occurTime": "Theo Hoa Kỳ: 21 tháng 1 năm 1968 – 8 tháng 4 năm 1968 Theo Việt Nam: 21 tháng 1 năm 1968 – 15 tháng 7 năm 1968",
    "place": "Khe Sanh, Quảng Trị - UTM Grid XD 852-4181",
    "result": "Quân Giải phóng miền Nam Việt Nam giành thắng lợi chiến lược:2 3 4 Quân Mỹ rút khỏi Khe Sanh, Quân Giải phóng miền Nam Việt Nam chiếm Khe Sanh từ giữa tháng 7. Trung tâm chỉ huy Hàng rào điện tử McNamara bị phá hủy. Chiến lược cắt Đường mòn Hồ Chí Minh của Hoa Kỳ thất bại. Đường mòn Hồ Chí Minh được mở rộng về phía Đông. Hoa Kỳ thất bại trong mục tiêu \"giữ Khe Sanh bằng mọi giá\" mà Tổng thống Johnson từng tuyên bố.5",
    "name": "Chiến dịch Đường 9 - Khe Sanh năm 1968",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-duong-9-khe-sanh-nam-1968",
    "detail": "Theo Việt Nam: 21 tháng 1 năm 1968 – 15 tháng 7 năm 1968",
    "relativeKeyWord": "đại tướng william c westmoreland toàn chiến trường đại tá david e lownds tại chỗ đại tướng võ nguyên giáp toàn chiến trường thiếu tướng trần qu hai tại chỗ thiếu tướng lê quang đạo tại chỗ đại tá cao văn khánhchiến dịch đường 9  khe sanh năm 1968theo hoa k 21 tháng 1 năm 1968  8 tháng 4 năm 1968 theo việt nam 21 tháng 1 năm 1968  15 tháng 7 năm 1968khe sanh quảng trị  utm grid xd 8524181quân giải phóng miền nam việt nam giành thắng lợi chiến lược2 3 4 quân m rút khỏi khe sanh quân giải phóng miền nam việt nam chiếm khe sanh từ giữa tháng 7 trung tâm chỉ huy hàng rào điện tử mcnamara bị phá hủy chiến lược cắt đường mòn hồ chí minh của hoa k thất bại đường mòn hồ chí minh được mở rộng về phía đông hoa k thất bại trong mục tiêu giữ khe sanh bằng mọi giá mà tổng thống johnson từng tuyên bố5"
  },
  {
    "occurTime": "30 tháng 1 - 3 tháng 3 1968",
    "place": "16°28′30,9″B 107°34′33,6″Đ / 16,46667°B 107,56667°Đ / 16.46667; 107.56667 (Battle of Huế)Tọa độ: 16°28′30,9″B 107°34′33,6″Đ / 16,46667°B 107,56667°Đ / 16.46667; 107.56667 (Battle of Huế) Huế, Việt Nam Cộng hòa",
    "result": "Hoa Kỳ và Việt Nam Cộng hòa thắng về chiến thuật. Thắng lợi về chính trị cho Mặt trận Dân tộc Giải phóng miền Nam.",
    "name": "Trận Mậu Thân tại Huế năm 1968",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-mau-than-tai-hue-nam-1968",
    "detail": "Theo QĐNDVN: 25.000 chết, bị thương, bị bắt hoặc tan rã. Phá hủy và làm hư hỏng hơn 200 máy bay, 41 tàu chiến và ca nô, 533 xe quân sự.",
    "relativeKeyWord": "ngô quang trưởng foster lahue lê minh lê tư minhtrận mậu thân tại huế năm 196830 tháng 1  3 tháng 3 19681628309b 10734336đ  1646667b 10756667đ  1646667 10756667 battle of huếtọa độ 1628309b 10734336đ  1646667b 10756667đ  1646667 10756667 battle of huế huế việt nam cộng hòahoa k và việt nam cộng hòa thắng về chiến thuật thắng lợi về chính trị cho mặt trận dân tộc giải phóng miền nam"
  },
  {
    "occurTime": "10 tháng 5 - 20 tháng 5 năm 1969",
    "place": "16°15′11″B 107°10′29″Đ / 16,25306°B 107,17472°Đ / 16.25306; 107.17472 Tỉnh Thừa Thiên, Việt Nam",
    "result": "Hai bên cùng tuyên bố chiến thắng, quân Mỹ sau đó rút đi, Quân Giải phóng miền Nam Việt Nam chiếm lại đồi.",
    "name": "Trận Đồi Thịt Băm năm 1969",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-doi-thit-bam-nam-1969",
    "detail": "Theo Quân Giải phóng miền Nam Việt Nam: Khoảng 1.300 chết hoặc bị thương 6 trực thăng bị bắn rơi, nhiều chiếc khác bị bắn hỏng",
    "relativeKeyWord": "melvin zais ma vĩnh lantrận đồi thịt băm năm 196910 tháng 5  20 tháng 5 năm 1969161511b 1071029đ  1625306b 10717472đ  1625306 10717472 tỉnh thừa thiên việt namhai bên cùng tuyên bố chiến thắng quân m sau đó rút đi quân giải phóng miền nam việt nam chiếm lại đồi"
  },
  {
    "occurTime": "8 tháng 2 – 20 tháng 3 năm 1971",
    "place": "18°16′38″B 102°41′0″Đ / 18,27722°B 102,68333°Đ / 18.27722; 102.68333 (Ban Dong)Tọa độ: 18°16′38″B 102°41′0″Đ / 18,27722°B 102,68333°Đ / 18.27722; 102.68333 (Ban Dong) Bản Đông, huyện Tchepone, tỉnh Savannakhet, Lào",
    "result": "Quân đội Nhân dân Việt Nam thắng",
    "name": "Trận Bản Đông năm 1971",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-ban-dong-nam-1971",
    "detail": "Trận Bản Đông là một trận đánh then chốt của Quân đội Nhân dân Việt Nam trong Chiến dịch Đường 9 - Nam Lào, diễn ra từ ngày 8 tháng 2 đến ngày 20 tháng 3 năm 1971.",
    "relativeKeyWord": "hoàng xuân lãm lê trọng tấntrận bản đông năm 19718 tháng 2  20 tháng 3 năm 1971181638b 102410đ  1827722b 10268333đ  1827722 10268333 ban dongtọa độ 181638b 102410đ  1827722b 10268333đ  1827722 10268333 ban dong bản đông huyện tchepone tỉnh savannakhet làoquân đội nhân dân việt nam thắng"
  },
  {
    "occurTime": "23 tháng 4-24 tháng 4 năm 1972",
    "place": "Cụm cứ điểm Đắk Tô - Tân Cảnh, tỉnh Kon Tum Nam Việt Nam",
    "result": "Quân Giải phóng miền Nam Việt Nam chiến thắng1 2 3",
    "name": "Chiến dịch Đắk Tô năm 1972",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-dak-to-nam-1972",
    "detail": "Chiến dịch Đắk Tô, thường được biết đến là trận trận Đắk Tô - Tân Cảnh là trận đánh mở màn cho Chiến dịch Bắc Tây Nguyên 1972 của Quân Giải phóng miền Nam Việt Nam, diễn ra từ ngày 23 tháng 4 đến ngày 24 tháng 4 năm 1972 trên địa bàn Đắk Tô và Tân Cảnh thuộc tỉnh Kon Tum. Đặc biệt trong chiến dịch này, Quân giải phóng Miền Nam Việt Nam đã sử dụng xe tăng hạng trung T-54 và tên lửa chống tăng 9M14 Malyutka (AT-3 Sagger) của Liên Xô gây nhiều thiệt hại cho đối phương.",
    "relativeKeyWord": "l tòng bá ngô du john paul vann  hoàng minh thảochiến dịch đắk tô năm 197223 tháng 424 tháng 4 năm 1972cụm cứ điểm đắk tô  tân cảnh tỉnh kon tum nam việt namquân giải phóng miền nam việt nam chiến thắng1 2 3"
  },
  {
    "occurTime": "13/12/1974 - 6/1/1975",
    "place": "11°51′3″B 106°59′48″Đ / 11,85083°B 106,99667°Đ / 11.85083; 106.99667Tọa độ: 11°51′3″B 106°59′48″Đ / 11,85083°B 106,99667°Đ / 11.85083; 106.99667 Phước Long, Nam Việt Nam",
    "result": "Chiến thắng quyết định của Quân Giải phóng miền Nam Việt Nam1",
    "name": "Chiến dịch Đường 14 - Phước Long năm 1974 - 1975",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-duong-14-phuoc-long-nam-1974-1975",
    "detail": "Chiến dịch đường 14-Phước Long là trận đụng độ quân sự lớn giữa Quân Giải phóng miền Nam Việt Nam và Quân lực Việt Nam Cộng hòa diễn ra trên địa bàn tỉnh Phước Long trong chiến tranh Việt Nam, kết quả là Quân Giải phóng miền Nam Việt Nam] chiến thắng và chiếm được Phước Long. Tuy không nằm trong chiến dịch Tây Nguyên nhưng trận Phước Long (từ đêm 13 tháng 12 năm 1974 đến ngày 6 tháng 1 năm 1975) có ý nghĩa như một trận đánh trinh sát chiến lược, thử sức đối với hai bên cũng như thăm dò phản ứng của quốc tế, nhất là của Hoa Kỳ để mở đầu cho những diễn biến tiếp theo của Chiến dịch Mùa Xuân 1975 đưa đến sự sụp đổ của Quân lực Việt Nam Cộng hòa và chính quyền Việt Nam Cộng hòa.",
    "relativeKeyWord": "hoàng cầm dư quốc đống nguyễn thống thànhchiến dịch đường 14  phước long năm 1974  197513121974  61197511513b 1065948đ  1185083b 10699667đ  1185083 10699667tọa độ 11513b 1065948đ  1185083b 10699667đ  1185083 10699667 phước long nam việt namchiến thắng quyết định của quân giải phóng miền nam việt nam1"
  },
  {
    "occurTime": "4/3 - 3/4/1975",
    "place": "Tây Nguyên, bao gồm các tỉnh Đắc Lắc, Phú Bổn, Gia Lai, Kon Tum, Quảng Đức, Việt Nam",
    "result": "Chiến thắng quyết định của Quân Giải phóng miền Nam Việt Nam1",
    "name": "Chiến dịch Tây Nguyên năm 1975",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-tay-nguyen-nam-1975",
    "detail": "Chiến dịch Tây Nguyên (từ 4 tháng 3 đến 3 tháng 4 năm 1975), mật danh Chiến dịch 275, là chiến dịch mở đầu cuộc Tổng tấn công và nổi dậy mùa Xuân năm 1975 do Quân Giải phóng miền Nam Việt Nam phát động tấn công. Với cuộc tiến công của phía Quân Giải phóng miền Nam Việt Nam ngày 10 tháng 3 năm 1975 vào Buôn Ma Thuột, cánh Nam của Quân đoàn II, Quân lực Việt Nam Cộng hòa đã bị sụp đổ. Những nỗ lực tái chiếm Buôn Ma Thuột của Quân lực Việt Nam Cộng hòa (QLVNCH) trong các trận phản công ngày 11 và 13 tháng 3 đều thất bại. Ngày 14 tháng 3, Tổng thống Việt Nam Cộng hòa Nguyễn Văn Thiệu, đồng thời là Tổng tư lệnh Quân lực Việt Nam Cộng hòa đã có một bước đi hết sức sai lầm khi ông ta quyết định rút quân trên toàn địa bàn Tây Nguyên để về giữ miền duyên hải Trung bộ. Ba ngày sau đó, hầu như toàn bộ Quân đoàn II Quân lực Việt Nam Cộng hòa bị tiêu diệt và tan rã trong cuộc rút quân hỗn loạn trên con đường số 7 định mệnh.",
    "relativeKeyWord": "hoàng minh thảo phạm văn phúchiến dịch tây nguyên năm 197543  341975tây nguyên bao gồm các tỉnh đắc lắc phú bổn gia lai kon tum quảng đức việt namchiến thắng quyết định của quân giải phóng miền nam việt nam1"
  },
  {
    "occurTime": "31 tháng 12 năm 1974 - 30 tháng 4 năm 1975",
    "place": "Miền Nam Việt Nam",
    "result": "Quân Giải phóng miền Nam Việt Nam giành chiến thắng1 Chính quyền Việt Nam Cộng hòa đầu hàng2",
    "name": "Chiến dịch Mùa Xuân năm 1975",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-dich-mua-xuan-nam-1975",
    "detail": "Quân đội Hoa Kỳ (cố vấn)",
    "relativeKeyWord": "văn tiến dũng lê trọng tấn hoàng minh thảo trần văn trà hoàng cầm nguyễn hữu an đinh đức thiện lê đức anh nguyễn hòa vũ lăng nguyễn văn thiệu cao văn viên ngô quang trưởng phạm văn phú nguyễn văn toàn nguyễn khoa nam đổng văn khuyến trần văn đôn chung tấn cang fredrick c weyandchiến dịch mùa xuân năm 197531 tháng 12 năm 1974  30 tháng 4 năm 1975miền nam việt namquân giải phóng miền nam việt nam giành chiến thắng1 chính quyền việt nam cộng hòa đầu hàng2"
  },
  {
    "occurTime": "Năm 1977 - tháng 12 năm 1989",
    "place": "Campuchia",
    "result": "Quân đội Nhân dân Việt Nam chiến thắng Chế độ Khmer Đỏ bị lật đổ. Quân đội Nhân dân Việt Nam rút quân lần 1 năm 1982 Quân đội Nhân dân Việt Nam cơ bản hoàn thành các nỗ lực bình định vào năm 1986. Tiếp tục xung đột giữa các bè phái Campuchia.",
    "name": "Chiến tranh biên giới Tây Nam năm 1975 - 1978",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-tranh-bien-gioi-tay-nam-nam-1975-1978",
    "detail": "Chính sách chống Việt Nam của chính quyền Khmer Đỏ. Pol Pot mở cuộc tấn công xâm lược Việt Nam trên toàn tuyến biên giới Tây Nam, thi hành chính sách diệt chủng đối với người Việt.",
    "relativeKeyWord": "lê trọng tấn lê đức anh hun sen heng samrin chea sim pol pot ieng sary khieu samphan nuon chea ta mokchiến tranh biên giới tây nam năm 1975  1978năm 1977  tháng 12 năm 1989campuchiaquân đội nhân dân việt nam chiến thắng chế độ khmer đỏ bị lật đổ quân đội nhân dân việt nam rút quân lần 1 năm 1982 quân đội nhân dân việt nam cơ bản hoàn thành các nỗ lực bình định vào năm 1986 tiếp tục xung đột giữa các bè phái campuchia"
  },
  {
    "occurTime": "14 tháng 3 năm 1988",
    "place": "Đá Gạc Ma, đá Cô Lin, đá Len Đao thuộc quần đảo Trường Sa",
    "result": "Trung Quốc chiếm đá Gạc Ma Việt Nam giữ được đá Cô Lin và đá Len Đao",
    "name": "Hải chiến Trường Sa năm 1988",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/hai-chien-truong-sa-nam-1988",
    "detail": "Hải chiến Trường Sa 1988 là tên gọi của một trận đánh trên biển Đông năm 1988 khi Hải quân Quân giải phóng Nhân dân Trung Hoa đưa quân tấn công hòng chiếm đóng bãi đá Cô Lin, bãi đá Len Đao và bãi đá Gạc Ma thuộc quần đảo Trường Sa. Sự kiện xảy ra vào mùa xuân 1988, khi mà dư luận thế giới đang tập trung vào tình hình Campuchia, trước khi các nước ASEAN lắng dịu lại quan hệ với Việt Nam trong vấn đề Campuchia9 .",
    "relativeKeyWord": "trần vĩ văn chen weiwen thuyền trưởng 502 nam sung nanchong trần đức thông lữ đoàn phó lữ đoàn 146 lê lệnh sơn thuyền trưởng hq605 vũ phi trừ thuyền trưởng hq604 vũ huy lễ thuyền trưởng hq505hải chiến trường sa năm 198814 tháng 3 năm 1988đá gạc ma đá cô lin đá len đao thuộc quần đảo trường satrung quốc chiếm đá gạc ma việt nam giữ được đá cô lin và đá len đao"
  },
  {
    "occurTime": "Năm 938",
    "place": "Sông Bạch Đằng (nay thuộc tỉnh Quảng Ninh, Việt Nam)",
    "result": "Người Việt đại thắng, chấm dứt hoàn toàn thời kỳ Bắc thuộc.",
    "name": "Trận Bạch Đằng lần thứ nhất năm 938",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-bach-dang-lan-thu-nhat-nam-938",
    "detail": ".",
    "relativeKeyWord": "trận bạch đằng lần thứ nhất năm 938năm 938sông bạch đằng nay thuộc tỉnh quảng ninh việt namngười việt đại thắng chấm dứt hoàn toàn thời k bắc thuộc"
  },
  {
    "occurTime": "?",
    "place": "?",
    "result": "?",
    "name": "Trận Bạch Đằng lần thứ hai năm 981",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-bach-dang-lan-thu-hai-nam-981",
    "detail": "Chiến tranh Tống-Việt năm 981 là một cuộc chiến tranh giữa Đại Tống thời Tống Thái Tông và Đại Cồ Việt thời Lê Đại Hành diễn ra từ tháng 1 đến tháng 4 năm 981 trên lãnh thổ Đại Cồ Việt. Kết quả, quân và dân Đại Cồ Việt đã đánh bại quân đội Đại Tống. Sau cuộc chiến này, năm 986, hoàng đế Đại Tống chấp nhận nhà Tiền Lê và ban chế phong cho Lê Đại Hành.",
    "relativeKeyWord": "trận bạch đằng lần thứ hai năm 981"
  },
  {
    "occurTime": "?",
    "place": "?",
    "result": "?",
    "name": "Trận Bạch Đằng lần thứ ba năm 1288",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-bach-dang-lan-thu-ba-nam-1288",
    "detail": "Trận Bạch Đằng năm 1288 xảy ra trên sông Bạch Đằng thuộc đất Đại Việt, là một trận đánh quan trọng trong các cuộc kháng chiến chống Nguyên Mông trong lịch sử Việt Nam.",
    "relativeKeyWord": "trận bạch đằng lần thứ ba năm 1288"
  },
  {
    "occurTime": "17 tháng 2 – 16 tháng 3 năm 1979",
    "place": "Toàn tuyến biên giới phía bắc của Việt Nam.",
    "result": "Cả hai bên cùng tuyên bố chiến thắng Trung Quốc phải rút quân. Việt Nam tái chiếm lãnh thổ, tiếp tục tham chiến ở Campuchia. Xung đột Biên giới kéo dài đến năm 1990",
    "name": "Chiến tranh biên giới Việt–Trung 1979",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-tranh-bien-gioi-viet-trung-1979",
    "detail": "Ủng hộ Cuba Liên Xô",
    "relativeKeyWord": "đặng tiểu bình từ hướng tiền dương đắc chí hứa thế hữu lê duẩn võ nguyên giáp văn tiến dũng đàm quang trung vũ lậpchiến tranh biên giới việttrung 197917 tháng 2  16 tháng 3 năm 1979toàn tuyến biên giới phía bắc của việt namcả hai bên cùng tuyên bố chiến thắng trung quốc phải rút quân việt nam tái chiếm lãnh thổ tiếp tục tham chiến ở campuchia xung đột biên giới kéo dài đến năm 1990"
  },
  {
    "occurTime": "Năm 1258",
    "place": "Bắc Bộ Việt Nam",
    "result": "Đại Việt chiến thắng; Quân Mông Cổ rút về Vân Nam",
    "name": "Chiến tranh Nguyên Mông - Đại Việt lần 1",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-tranh-nguyen-mong-dai-viet-lan-1",
    "detail": "Chiến tranh Nguyên Mông-Đại Việt lần thứ nhất hay Kháng chiến chống Nguyên Mông lần thứ nhất là cách người Việt Nam gọi cuốc chiến đấu của quân dân Đại Việt chống lại quân đội của đế quốc Mông Cổ do Uriyangqatai (Ngột Lương Hợp Thai) chỉ huy vào trong khoảng thời gian nửa tháng cuối tháng 1 năm 1258 (hay năm Nguyên Phong thứ 7). Cuộc chiến mở đầu với thất bại của quân Đại Việt trong trận Bình Lệ Nguyên, nhưng cuối cùng họ đã đại phá quân Nguyên trong trận Đông Bộ Đầu. Cuộc chiến này đã kết thúc với chiến thắng của nước Đại Việt, ghi dấu công lao của vua Trần Thái Tông trong việc lãnh đạo quân dân chiến đấu chống quân xâm lược.",
    "relativeKeyWord": "trần thái tông trần thánh tông trần thủ độ linh từ quốc mẫu lê phụ trần hà bổng uriyangqatai ngột lương hợp thai aju a truật cacakdu triệt triệt đô quaidu hoài đô abiskachiến tranh nguyên mông  đại việt lần 1năm 1258bắc bộ việt namđại việt chiến thắng quân mông cổ rút về vân nam"
  },
  {
    "occurTime": "Năm 1285",
    "place": "Bắc Bộ và Bắc Trung Bộ Việt Nam",
    "result": "Quân Đại Việt chiến thắng, Nguyên Mông phải rút lui khỏi Đại Việt",
    "name": "Chiến tranh Nguyên Mông - Đại Việt lần 2",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-tranh-nguyen-mong-dai-viet-lan-2",
    "detail": "Chiến tranh Nguyên Mông-Đại Việt lần 2 là cuộc chiến tranh giữa Đại Nguyên và Đại Việt diễn ra trên lãnh thổ Đại Việt từ cuối tháng 1 đến cuối tháng 5 năm 1285 (dương lịch).",
    "relativeKeyWord": "trần thánh tông trần nhân tông trần quốc tuấn trần quang khải trần nhật duật trần khánh dư trần bình trọng trần quốc toản phạm ngũ lão trần quốc hiến nguyễn khoái nguyễn thế lộc hà chương hà đặc triệu trung thoát hoan ariq qaya a l hải nha ô mã nhi l hằng koncak khoan triệt bolqadar bột la hợp đáp nhĩ satartai sát tháp nhi đài mangqudai mãng cổ thái naqai nạp hải l bang hiến tôn hựu tôn đức lâm lưu thế anh lưu khuê nghê nhuậnchiến tranh nguyên mông  đại việt lần 2năm 1285bắc bộ và bắc trung bộ việt namquân đại việt chiến thắng nguyên mông phải rút lui khỏi đại việt"
  },
  {
    "occurTime": "năm 1287-1288",
    "place": "Bắc Bộ Việt Nam",
    "result": "Quân Đại Việt toàn thắng, Nguyên Mông phải rút lui khỏi Đại Việt",
    "name": "Chiến tranh Nguyên Mông - Đại Việt lần 3",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-tranh-nguyen-mong-dai-viet-lan-3",
    "detail": "Chiến tranh Nguyên Mông-Đại Việt lần 3 (theo cách gọi khác ở Việt Nam là Kháng chiến chống quân Nguyên Mông lần thứ 3) là cuộc chiến tranh giữa Đại Nguyên và Đại Việt diễn ra trên lãnh thổ Đại Việt từ tháng 12 năm 1287 đến cuối tháng 4 năm 1288.",
    "relativeKeyWord": "trần thái tông trần nhân tông trần quốc tuấn trần quang khải trần nhật duật trần khánh dư phạm ngũ lão trần gia nguyễn khoái nguyễn thế lộc trần ngạc đỗ hành trương văn hổ thoát hoan ariq qaya a l hải nha ô mã nhi ayuruychi áo lỗ xích phàn tiếp tích lệ cơ yiymis diệc hắc mê thất ariq qusun a l quy thuận abaci a bát xích ali a l trình bằng phi aruq ái lỗ trương ngọc lưu khuê siktur tích đô nhi trương văn hổ phí củng thìn đào đại minh trần trọng đạt tạ hữu khuê bồ t thành trần ích tắc lê tắcchiến tranh nguyên mông  đại việt lần 3năm 12871288bắc bộ việt namquân đại việt toàn thắng nguyên mông phải rút lui khỏi đại việt"
  },
  {
    "occurTime": "?",
    "place": "?",
    "result": "?",
    "name": "Chiến tranh Tống-Việt, 1075-1077",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/chien-tranh-tong-viet-1075-1077",
    "detail": "Chiến tranh Tống - Việt, 1075-1077 là tên gọi cuộc chiến tranh giữa nhà Lý nước Đại Việt và nhà Tống của Trung Quốc vào cuối thế kỷ 11. Giai đoạn đầu, tướng nhà Lý là Lý Thường Kiệt đã chủ động đánh sang đất Tống trong chiến dịch 1075-1076; Giai đoạn sau, quân Lý rút về phòng thủ chống lại cuộc nam tiến của đại quân Tống trong năm 1076-1077 và cuối cùng đẩy lui được quân Tống ra khỏi lãnh thổ Đại Việt.",
    "relativeKeyWord": "chiến tranh tốngviệt 10751077"
  },
  {
    "occurTime": "18 tháng 1, 1077-28 tháng 2, 1077",
    "place": "Sông Như Nguyệt, Đại Việt",
    "result": "Chiến thắng quyết định cho Đại Việt",
    "name": "Trận Như Nguyệt năm 1077",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-nhu-nguyet-nam-1077",
    "detail": "Trận Như Nguyệt là một trận đánh lớn diễn ra ở một khúc sông Như Nguyệt (hay sông Cầu) vào năm 1077, là trận đánh có tính quyết định của cuộc Chiến tranh Tống - Việt, 1075-1077, và là trận đánh cuối cùng của nhà Tống trên đất Đại Việt. Trận chiến diễn ra trong nhiều tháng, kết thúc bằng chiến thắng của quân đội Đại Việt và thiệt hại nhân mạng lớn của quân Tống, đánh bại hoàn toàn ý chí xâm lược Đại Việt của họ, buộc họ phải thừa nhận Đại Việt là một quốc gia.",
    "relativeKeyWord": "quách qu triệu tiết miêu l hoà mâu l thường kiệt hoằng chân  chiêu văn  thân cảnh phúc  l kế nguyêntrận như nguyệt năm 107718 tháng 1 107728 tháng 2 1077sông như nguyệt đại việtchiến thắng quyết định cho đại việt"
  },
  {
    "occurTime": "1418 - 1427",
    "place": "Việt Nam (kéo dài đến Thuận Hóa)",
    "result": "Thắng lợi hoàn toàn của nghĩa quân Lam Sơn. Hội thề Đông Quan, quân Minh rút về nước",
    "name": "Khởi nghĩa Lam Sơn (1418 - 1427)",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/khoi-nghia-lam-son",
    "detail": "Khởi nghĩa Lam Sơn (1418-1427) (chữ Nôm: 起義藍山) là cuộc khởi nghĩa đánh đuổi quân Minh xâm lược về nước do Lê Lợi lãnh đạo và kết thúc bằng việc giành lại độc lập cho nước Đại Việt và sự thành lập nhà Hậu Lê.",
    "relativeKeyWord": "lê lợi nguyễn trãi lưu nhân chú nguyễn chích nguyễn xí phạm vấn phạm văn xảo lê sát lê ngân lê lai  trần nguyên hãn trần cảo đinh liệt đinh lễ l an phương chính trần trí l bân  thái phúc vương thông vương an lão liễu thăng  mộc thạnh lương minh  l khánh  hoàng phúckhởi nghĩa lam sơn 1418  14271418  1427việt nam kéo dài đến thuận hóathắng lợi hoàn toàn của nghĩa quân lam sơn hội thề đông quan quân minh rút về nước"
  },
  {
    "occurTime": "5-7 tháng 10 năm Bính Ngọ (1426)",
    "place": "Chúc Sơn, xã Ngọc Sơn, huyện Chương Mĩ, Hà Nội",
    "result": "Chiến thắng quyết định của nghĩa quân Lam Sơn",
    "name": "Trận Tốt Động – Chúc Động năm 1426",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-tot-dong-chuc-dong",
    "detail": "Trận Tốt Động – Chúc Động là trận đánh diễn ra trong các ngày 5-7 tháng 10 năm Bính Ngọ (1426), giữa nghĩa quân Lam Sơn với quân nhà Minh đóng ở Đông Quan (tức là Thăng Long, Hà Nội). Đây là một chiến thắng quân sự lớn của nghĩa quân Lam Sơn và được nhắc đến trong Bình Ngô đại cáo.",
    "relativeKeyWord": "l triện đinh lễ đỗ bí nguyễn xí trương chiến vương thông phương chính mã k sơn thọ l an trần hiệp mã anhtrận tốt động  chúc động năm 142657 tháng 10 năm bính ngọ 1426chúc sơn xã ngọc sơn huyện chương mĩ hà nộichiến thắng quyết định của nghĩa quân lam sơn"
  },
  {
    "occurTime": "8 tháng 10 năm 1427 đến ngày 3 tháng 1 năm 1428",
    "place": "Chi Lăng, Xương Giang",
    "result": "Thắng lợi quyết định của nghĩa quân Lam Sơn",
    "name": "Trận Chi Lăng – Xương Giang năm 1427",
    "source": "https://nguoikesu.com/tu-lieu/quan-su/tran-chi-lang-xuong-giang",
    "detail": "Chiến dịch Chi Lăng – Xương Giang là một loạt trận đánh diễn ra từ ngày 18 tháng 9 năm 1427 đến cuối tháng 10, năm 1427 giữa lực lượng khởi nghĩa Lam Sơn của Việt Nam và 2 đạo quân viện binh nhà Minh do Liễu Thăng và Mộc Thạnh chỉ huy. Quân Lam Sơn đã giành được chiến thắng quyết định.",
    "relativeKeyWord": "minh tuyên tông liễu thăng lương minh lê lợitrận chi lăng  xương giang năm 14278 tháng 10 năm 1427 đến ngày 3 tháng 1 năm 1428chi lăng xương giangthắng lợi quyết định của nghĩa quân lam sơn"
  }
]